<!DOCTYPE html>
<html lang=zh>
<head>
    <meta charset="utf-8">
    
    <title>WMS进化论之二 – 简单 不简单 | 微仓博客</title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1" />
    <meta name="description" content="&amp;#x81EA;&amp;#x4ECE;&amp;#x4E0A;&amp;#x6B21;&amp;#x63D0;&amp;#x51FA;&amp;#x4E86;WMS&amp;#x8FDB;&amp;#x5316;&amp;#x8BBA;&amp;#xFF0C;&amp;#x7ED3;&amp;#x679C;&amp;#x88AB;&amp;#x597D;&amp;#x53CB;&amp;#x8C03;&amp;#x4F83;&amp;#xFF0C;&amp;#x201C;&amp;#x4F60;&amp;#x8BF4;&amp;#x7684;&amp;#x8FD9;&amp;#x4E">
<meta property="og:type" content="article">
<meta property="og:title" content="WMS进化论之二 – 简单 不简单">
<meta property="og:url" content="http://vwms.cn/2016/11/01/WMS进化论之二 – 简单 不简单/index.html">
<meta property="og:site_name" content="微仓博客">
<meta property="og:description" content="&amp;#x81EA;&amp;#x4ECE;&amp;#x4E0A;&amp;#x6B21;&amp;#x63D0;&amp;#x51FA;&amp;#x4E86;WMS&amp;#x8FDB;&amp;#x5316;&amp;#x8BBA;&amp;#xFF0C;&amp;#x7ED3;&amp;#x679C;&amp;#x88AB;&amp;#x597D;&amp;#x53CB;&amp;#x8C03;&amp;#x4F83;&amp;#xFF0C;&amp;#x201C;&amp;#x4F60;&amp;#x8BF4;&amp;#x7684;&amp;#x8FD9;&amp;#x4E">
<meta property="og:image" content="http://oflf20p0h.bkt.clouddn.com/cloud.jpg">
<meta property="og:image" content="http://oflf20p0h.bkt.clouddn.com/1.jpg">
<meta property="og:image" content="http://oflf20p0h.bkt.clouddn.com/2.jpg">
<meta property="og:image" content="http://oflf20p0h.bkt.clouddn.com/3.jpg">
<meta property="og:image" content="http://oflf20p0h.bkt.clouddn.com/4.jpg">
<meta property="og:image" content="http://oflf20p0h.bkt.clouddn.com/5.jpg">
<meta property="og:image" content="http://oflf20p0h.bkt.clouddn.com/6.jpg">
<meta property="og:updated_time" content="2016-11-01T03:02:52.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="WMS进化论之二 – 简单 不简单">
<meta name="twitter:description" content="&amp;#x81EA;&amp;#x4ECE;&amp;#x4E0A;&amp;#x6B21;&amp;#x63D0;&amp;#x51FA;&amp;#x4E86;WMS&amp;#x8FDB;&amp;#x5316;&amp;#x8BBA;&amp;#xFF0C;&amp;#x7ED3;&amp;#x679C;&amp;#x88AB;&amp;#x597D;&amp;#x53CB;&amp;#x8C03;&amp;#x4F83;&amp;#xFF0C;&amp;#x201C;&amp;#x4F60;&amp;#x8BF4;&amp;#x7684;&amp;#x8FD9;&amp;#x4E">
<meta name="twitter:image" content="http://oflf20p0h.bkt.clouddn.com/cloud.jpg">
    

    
        <link rel="alternate" href="/" title="微仓博客" type="application/atom+xml" />
    

    
        <link rel="icon" href="/favicon.ico" />
    

    <link rel="stylesheet" href="/vendor/font-awesome/css/font-awesome.min.css">
    <link rel="stylesheet" href="/vendor/open-sans/styles.css">
    <link rel="stylesheet" href="/vendor/source-code-pro/styles.css">

    <link rel="stylesheet" href="/css/style.css">

    <script src="/vendor/jquery/2.1.3/jquery.min.js"></script>
    
    
        <link rel="stylesheet" href="/vendor/lightgallery/css/lightgallery.min.css">
    
    
        <link rel="stylesheet" href="/vendor/justified-gallery/justifiedGallery.min.css">
    
    
    
    


</head>

<body>
    <div id="container">
        <header id="header">
    <div id="header-main" class="header-inner">
        <div class="outer">
            <a href="/" id="logo">
                <i class="logo"></i>
                <span class="site-title">微仓博客</span>
            </a>
            <nav id="main-nav">
                
                    <a class="main-nav-link" href="/.">首页</a>
                
                    <a class="main-nav-link" href="/archives">归档</a>
                
                    <a class="main-nav-link" href="/about">关于</a>
                
            </nav>
            
                
                <nav id="sub-nav">
                    <div class="profile" id="profile-nav">
                        <a id="profile-anchor" href="javascript:;">
                            <img class="avatar" src="/css/images/avatar.png" />
                            <i class="fa fa-caret-down"></i>
                        </a>
                    </div>
                </nav>
            
			<div id="search-form-wrap">

    <form class="search-form">
        <input type="text" class="st-default-search-input search-form-input" placeholder="搜索" />
        <button type="submit" class="search-form-submit"></button>
    </form>
    <script type="text/javascript">
(function(w,d,t,u,n,s,e) {w['SwiftypeObject']=n;w[n]=w[n]||function() {
(w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
})(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

_st('install','true','2.0.0');
</script>
<style>
    .st-ui-injected-overlay-container,
    .st-ui-injected-overlay-container *:not(select) {
        font-family: inherit !important;
    }
    section.st-ui-content.st-search-results a.st-ui-result .st-ui-type-heading {
        color: undefined !important;
    }
    .st-ui-injected-overlay-container .st-ui-header input[type="text"]:focus {
        border-bottom: 2px solid undefined;
    }
    .st-ui-injected-overlay-container .st-ui-footer a.st-ui-pagination-link {
        color: undefined;
    }
    .st-ui-injected-overlay-container .st-ui-footer a.st-ui-pagination-link span.st-ui-arrow {
        border-color: undefined;
    }
</style>

</div>
        </div>
    </div>
    <div id="main-nav-mobile" class="header-sub header-inner">
        <table class="menu outer">
            <tr>
                
                    <td><a class="main-nav-link" href="/.">首页</a></td>
                
                    <td><a class="main-nav-link" href="/archives">归档</a></td>
                
                    <td><a class="main-nav-link" href="/about">关于</a></td>
                
                <td>
                    
    <div class="search-form">
        <input type="text" class="st-default-search-input search-form-input" placeholder="搜索" />
    </div>

                </td>
            </tr>
        </table>
    </div>
</header>

        <div class="outer">
            
                

<aside id="profile">
    <div class="inner profile-inner">
        <div class="base-info profile-block">
            <img id="avatar" src="/css/images/avatar.png" />
            <h2 id="name">Vwms</h2>
            <h3 id="title">more than a wms</h3>
            <span id="location"><i class="fa fa-map-marker"></i>shanghai, China</span>
            <a id="follow" target="_blank" href="http://www.vwms.cn">关注我</a>
        </div>
        <div class="article-info profile-block">
            <div class="article-info-block">
                6
                <span>文章</span>
            </div>
            <div class="article-info-block">
                9
                <span>标签</span>
            </div>
        </div>
        
       <!-- <div class="profile-block social-links">
            <table>
                <tr>
                    
                    
                    <td>
                        <a href="http://github.com/ppoffice/hexo-theme-icarus" target="_blank" title="github" class=tooltip>
                            <i class="fa fa-github"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="twitter" class=tooltip>
                            <i class="fa fa-twitter"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="facebook" class=tooltip>
                            <i class="fa fa-facebook"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="dribbble" class=tooltip>
                            <i class="fa fa-dribbble"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="rss" class=tooltip>
                            <i class="fa fa-rss"></i>
                        </a>
                    </td>
                    
                </tr>
            </table>
        </div>-->
        
    </div>
</aside>

            
            <section id="main"><article id="post-WMS进化论之二 – 简单 不简单" class="article article-type-post" itemscope itemprop="blogPost">
    <div class="article-inner">
        
        
            <header class="article-header">
                
    
        <h1 class="article-title" itemprop="name">
            WMS进化论之二 – 简单 不简单
        </h1>
    

                
                    <div class="article-meta">
                        
    <div class="article-date">
        <i class="fa fa-calendar"></i>
        <a href="/2016/11/01/WMS进化论之二 – 简单 不简单/">
            <time datetime="2016-11-01T03:02:52.000Z" itemprop="datePublished">2016-11-01</time>
        </a>
    </div>


                        
                        
    <div class="article-tag">
        <i class="fa fa-tag"></i>
        <a class="tag-link" href="/tags/SaaSWMS/">SaaSWMS</a>, <a class="tag-link" href="/tags/WMS/">WMS</a>
    </div>

                    </div>
                
            </header>
        
        
        <div class="article-entry" itemprop="articleBody">
        
            
            <p><img src="http://oflf20p0h.bkt.clouddn.com/cloud.jpg" alt=""><br>&#x81EA;&#x4ECE;&#x4E0A;&#x6B21;&#x63D0;&#x51FA;&#x4E86;WMS&#x8FDB;&#x5316;&#x8BBA;&#xFF0C;&#x7ED3;&#x679C;&#x88AB;&#x597D;&#x53CB;&#x8C03;&#x4F83;&#xFF0C;&#x201C;&#x4F60;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;SaaS&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x662F;&#x6280;&#x672F;&#x672C;&#x8EAB;&#x5E26;&#x6765;&#x7684;&#x9769;&#x547D;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x7528;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4EA7;&#x54C1;&#x90FD;&#x5177;&#x5907;&#x8FD9;&#x4E9B;&#xFF0C;&#x5FAE;&#x4ED3;&#x8FD8;&#x6709;&#x522B;&#x7684;&#x5417;&#xFF1F;&#x201D;&#x597D;&#x5427;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x5C31;&#x6765;&#x804A;&#x70B9;&#x522B;&#x7684;&#x3002;<br>&#xFF08;&#x6E29;&#x99A8;&#x63D0;&#x793A;&#xFF1A;&#x524D;&#x65B9;&#x591A;&#x56FE;&#xFF09;<a id="more"></a></p>
<p><strong>&#x5728;&#x6B63;&#x5F0F;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x770B;&#x5F20;&#x56FE;&#xFF1A;</strong></p>
<p><img src="http://oflf20p0h.bkt.clouddn.com/1.jpg" alt=""></p>
<p><strong>&#x518D;&#x6765;&#x4E00;&#x4E2A;&#xFF0C;</strong></p>
<p><img src="http://oflf20p0h.bkt.clouddn.com/2.jpg" alt=""></p>
<p><strong>&#x5927;&#x5BB6;&#x4EC0;&#x4E48;&#x611F;&#x53D7;&#xFF1F;&#x597D;&#x4E13;&#x4E1A;&#xFF1F;&#x597D;&#x5F3A;&#x5927;&#xFF1F;&#x529F;&#x80FD;&#x597D;&#x591A;&#x597D;&#x590D;&#x6742;&#xFF1F;&#x8FD9;&#x5957;&#x7CFB;&#x7EDF;&#x4E0D;&#x7B80;&#x5355;&#xFF1F;</strong></p>
<p>&#x73B0;&#x5728;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x4F53;&#x4F1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4F20;&#x7EDF;&#x7269;&#x6D41;&#x8F6F;&#x4EF6;&#x4F01;&#x4E1A;&#x4E0D;&#x613F;&#x610F;&#x8BA9;&#x7528;&#x6237;&#x8BD5;&#x7528;&#x4E86;&#x5417;&#xFF1F;&#x4F60;&#x8BF4;&#x8FD9;&#x6837;&#x7684;&#x529F;&#x80FD;&#x548C;&#x754C;&#x9762;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x7ED9;&#x7528;&#x6237;&#x89E3;&#x91CA;&#x6E05;&#x695A;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x5C11;&#x4E13;&#x4E1A;&#x7ECF;&#x9A8C;&#xFF0C;&#x624D;&#x80FD;&#x5F04;&#x660E;&#x767D;&#x8FD9;&#x4E9B;&#x52FE;&#x52FE;&#x9009;&#x9009;&#x662F;&#x795E;&#x9A6C;&#x610F;&#x601D;&#x3002;</p>
<p>&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x7ED9;&#x4E13;&#x4E1A;&#x7528;&#x6237;&#x7528;&#x7684;&#xFF0C;&#x4F5C;&#x4E3A;SaaS&#x7684;&#x4E3B;&#x8981;&#x53D7;&#x4F17;&#x5927;&#x591A;&#x6570;&#x4E2D;&#x5C0F;&#x4F01;&#x4E1A;&#x4ECE;&#x4E1A;&#x8005;&#x800C;&#x8A00;&#xFF0C;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x7CBE;&#x529B;&#x53BB;&#x7814;&#x7A76;&#x53BB;&#x7406;&#x89E3;&#x4F60;&#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#xFF0C;&#x4ED6;&#x4EEC;&#x66F4;&#x9700;&#x8981;&#x4E00;&#x5957;&#x4EBA;&#x6027;&#x5316;&#x7B80;&#x7EA6;&#x9AD8;&#x6548;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E3E;&#x4E2A;&#x6817;&#x5B50;&#xFF0C;&#x8FD9;&#x662F;&#x67D0;&#x5BA2;&#x6237;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x590D;&#x6838;&#x9875;&#x9762;&#xFF1A;</p>
<p><img src="http://oflf20p0h.bkt.clouddn.com/3.jpg" alt=""></p>
<p><strong>&#x8FD9;&#x4E2A;&#x662F;&#x6211;&#x4EEC;&#x4EA7;&#x54C1;&#x76EE;&#x524D;&#x7684;&#x590D;&#x6838;&#x9875;&#x9762;&#xFF1A;</strong></p>
<p><img src="http://oflf20p0h.bkt.clouddn.com/4.jpg" alt=""></p>
<p><strong>&#x4F60;&#x8981;&#x95EE;&#x6211;&#x8FD9;&#x4E24;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x6211;&#x53EA;&#x80FD;&#x8BF4;&#xFF0C;&#x8C01;&#x7528;&#x8C01;&#x77E5;&#x9053;&#x3002;</strong></p>
<p>&#x5728;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x7B79;&#x5907;&#x505A;&#x8FD9;&#x5957;&#x4EA7;&#x54C1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x539F;&#x5219;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x7528;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x6765;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x548C;&#x8BBE;&#x8BA1;WMS&#x4EA7;&#x54C1;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x7528;&#x6237;&#x9700;&#x6C42;&#x3001;&#x884C;&#x4E3A;&#x3001;&#x611F;&#x53D7;&#x3001;&#x60C5;&#x7EEA;&#x3001;&#x75DB;&#x70B9;&#x7B49;&#x7528;&#x6237;&#x573A;&#x666F;&#x5E76;&#x6309;&#x5BA2;&#x6237;&#x65C5;&#x7A0B;&#x56FE;&#x6765;&#x505A;&#x6D41;&#x7A0B;&#x8BBE;&#x8BA1;&#x7684;&#x6307;&#x5BFC;&#xFF0C;&#x5C06;&#x6BCF;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x73AF;&#x8282;&#x548C;&#x64CD;&#x4F5C;&#x8282;&#x70B9;&#x91CD;&#x65B0;&#x68B3;&#x7406;&#xFF0C;&#x6253;&#x9020;&#x4E00;&#x5957;&#x771F;&#x6B63;&#x8BA9;&#x7528;&#x6237;&#x7528;&#x7684;&#x723D;&#x7684;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x4EE5;&#x4E0A;&#x539F;&#x5219;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5728;&#x590D;&#x6838;&#x9875;&#x9762;&#x4E2D;&#x4F5C;&#x4E1A;&#x4EBA;&#x5458;&#x66F4;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x8BA2;&#x5355;&#x4E2D;&#x7684;&#x5546;&#x54C1;&#x548C;&#x6570;&#x91CF;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x66F4;&#x591A;&#x65F6;&#x5019;&#x590D;&#x6838;&#x53F0;&#x90FD;&#x662F;&#x7528;&#x7684;&#x53F0;&#x5F0F;&#x673A;&#xFF0C;&#x79BB;&#x7528;&#x6237;&#x89C6;&#x7EBF;&#x8F83;&#x8FDC;&#xFF0C;&#x4ED3;&#x5E93;&#x4E2D;&#x7684;&#x5149;&#x7EBF;&#x8F83;&#x6697;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x9AD8;&#x4EAE;&#x7684;&#x989C;&#x8272;&#x548C;&#x58F0;&#x97F3;&#x6765;&#x63D0;&#x793A;&#x7528;&#x6237;&#x4F5C;&#x4E1A;&#x4E2D;&#x7684;&#x6B63;&#x5E38;&#x4E0E;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x53EA;&#x7ED9;&#x5230;&#x73B0;&#x573A;&#x4EBA;&#x5458;&#x4ED6;/&#x5979;&#x6700;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x800C;&#x5173;&#x4E8E;&#x8FD0;&#x5355;&#x3001;&#x53D1;&#x7968;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x7684;&#x4EBA;&#x5458;&#x72EC;&#x7ACB;&#x7684;&#x6D41;&#x7A0B;&#x6765;&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x5E72;&#x561B;&#x4E0D;&#x7528;&#x5355;&#x72EC;&#x7684;&#x754C;&#x9762;&#x5904;&#x7406;&#x5462;&#xFF1F;</p>
<p>&#x4E5F;&#x8BB8;&#x6709;&#x4EBA;&#x4F1A;&#x8BF4;&#xFF0C;&#x4F01;&#x4E1A;&#x8F6F;&#x4EF6;&#x5929;&#x7136;&#x6709;&#x4E2A;&#x7279;&#x70B9;&#x4F60;&#x4EEC;&#x5FFD;&#x7565;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x5BA2;&#x6237;&#x8DDF;&#x7528;&#x6237;&#x4E0D;&#x662F;&#x4E00;&#x62E8;&#x4EBA;&#xFF0C;&#x82B1;&#x94B1;&#x7684;&#x4EBA;&#x4E0D;&#x4F1A;&#x53BB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x8BBE;&#x8BA1;&#x518D;&#x597D;&#x4E5F;&#x6CA1;&#x7528;&#x3002;&#x82B1;&#x94B1;&#x7684;&#x4EBA;&#x53EA;&#x5173;&#x6CE8;&#x4EEA;&#x8868;&#x76D8;&#xFF0C;&#x5173;&#x6CE8;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x3002;&#x522B;&#x6025;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4EEA;&#x8868;&#x76D8;&#xFF0C;1.0&#x7248;&#x672C;&#x7684;&#x4EEA;&#x8868;&#x76D8;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p><img src="http://oflf20p0h.bkt.clouddn.com/5.jpg" alt=""></p>
<p><strong>&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x5982;&#x4F55;&#x5E2E;&#x7528;&#x6237;&#x5B9E;&#x73B0;&#x529F;&#x80FD;&#xFF0C;&#x66F4;&#x5173;&#x6CE8;&#x5982;&#x4F55;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x66F4;&#x597D;&#xFF0C;&#x4E00;&#x4E2A;&#x987A;&#x624B;&#x7684;&#x5DE5;&#x5177;&#x9700;&#x8981;&#x5177;&#x5907;&#x4E0A;&#x624B;&#x5FEB;&#xFF0C;&#x6613;&#x64CD;&#x4F5C;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x800C;&#x770B;&#x8D77;&#x6765;&#x7B80;&#x5355;&#x5C31;&#x662F;&#x5FC5;&#x987B;&#x8981;&#x8FFD;&#x6C42;&#x7684;&#x76EE;&#x6807;&#x3002;</strong></p>
<p>&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5F88;&#x591A;&#x4EBA;&#x6765;&#x8BD5;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x7ECF;&#x5E38;&#x63A5;&#x5230;&#x7535;&#x8BDD;&#x8BF4;&#x4F60;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x770B;&#x8D77;&#x6765;&#x597D;&#x7B80;&#x5355;&#xFF1F;&#x6211;&#x53EA;&#x80FD;&#x8BF4;&#xFF0C;&#x7B80;&#x5355;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8FFD;&#x6C42;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x518D;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x770B;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x201C;&#x7B80;&#x5355;&#x201D;&#x7684;&#x7CFB;&#x7EDF;&#x80FD;&#x5426;&#x6EE1;&#x8DB3;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x3002;</p>
<p><strong>&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x4E3A;&#x4E86;&#x8BA9;&#x7528;&#x6237;&#x89C9;&#x5F97;&#x4E13;&#x4E1A;&#x800C;&#x5F00;&#x653E;&#x5927;&#x91CF;&#x7528;&#x6237;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x7684;&#x914D;&#x7F6E;&#x5F00;&#x5173;&#x7ED9;&#x4ED6;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x61D2;&#x60F0;&#x800C;&#x4E0D;&#x5206;&#x573A;&#x666F;&#x7684;&#x628A;&#x6240;&#x6709;&#x5B57;&#x6BB5;&#x5806;&#x5728;&#x4E00;&#x4E2A;&#x8868;&#x683C;&#x91CC;&#x8BA9;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x7FFB;&#x627E;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x6280;&#x672F;&#x96BE;&#x5EA6;&#x800C;&#x6446;&#x4E00;&#x5806;&#x67E5;&#x8BE2;&#x548C;&#x7B5B;&#x9009;&#x6761;&#x4EF6;&#x51FA;&#x6765;&#xFF0C;&#x4E00;&#x4E2A;&#x5168;&#x6587;&#x68C0;&#x7D22;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x6240;&#x6709;&#x67E5;&#x8BE2;&#xFF0C;&#x4E00;&#x4E2A;&#x4E0B;&#x62C9;&#x7BAD;&#x5934;&#x53EF;&#x4EE5;&#x7B5B;&#x9009;&#x51FA;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF1B;&#x6211;&#x4EEC;&#x4F1A;&#x5173;&#x6CE8;&#x6BCF;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x5173;&#x6CE8;&#x6BCF;&#x4E00;&#x4E2A;&#x8868;&#x683C;&#xFF0C;&#x5173;&#x6CE8;&#x6BCF;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x505A;&#x5230;&#x5B8C;&#x7F8E;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x5728;&#x52AA;&#x529B;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x4F1A;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x5FEB;&#x7684;&#x6210;&#x957F;&#xFF01;</strong><br><img src="http://oflf20p0h.bkt.clouddn.com/6.jpg" alt=""></p>

        
        </div>
       <!-- <footer class="article-footer">
            <div class="share-container">



</div>

    <a data-url="http://vwms.cn/2016/11/01/WMS进化论之二 – 简单 不简单/" data-id="cj6do8w0o00058zgrp2qos0az" class="article-share-link"><i class="fa fa-share"></i>分享到</a>
<script>
    (function ($) {
        // Prevent duplicate binding
        if (typeof(__SHARE_BUTTON_BINDED__) === 'undefined' || !__SHARE_BUTTON_BINDED__) {
            __SHARE_BUTTON_BINDED__ = true;
        } else {
            return;
        }
        $('body').on('click', function() {
            $('.article-share-box.on').removeClass('on');
        }).on('click', '.article-share-link', function(e) {
            e.stopPropagation();

            var $this = $(this),
                url = $this.attr('data-url'),
                encodedUrl = encodeURIComponent(url),
                id = 'article-share-box-' + $this.attr('data-id'),
                offset = $this.offset(),
                box;

            if ($('#' + id).length) {
                box = $('#' + id);

                if (box.hasClass('on')){
                    box.removeClass('on');
                    return;
                }
            } else {
                var html = [
                    '<div id="' + id + '" class="article-share-box">',
                        '<input class="article-share-input" value="' + url + '">',
                        '<div class="article-share-links">',
                            '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="fa fa-twitter article-share-twitter" target="_blank" title="Twitter"></a>',
                            '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="fa fa-facebook article-share-facebook" target="_blank" title="Facebook"></a>',
                            '<a href="http://pinterest.com/pin/create/button/?url=' + encodedUrl + '" class="fa fa-pinterest article-share-pinterest" target="_blank" title="Pinterest"></a>',
                            '<a href="https://plus.google.com/share?url=' + encodedUrl + '" class="fa fa-google article-share-google" target="_blank" title="Google+"></a>',
                        '</div>',
                    '</div>'
                ].join('');

              box = $(html);

              $('body').append(box);
            }

            $('.article-share-box.on').hide();

            box.css({
                top: offset.top + 25,
                left: offset.left
            }).addClass('on');

        }).on('click', '.article-share-box', function (e) {
            e.stopPropagation();
        }).on('click', '.article-share-box-input', function () {
            $(this).select();
        }).on('click', '.article-share-box-link', function (e) {
            e.preventDefault();
            e.stopPropagation();

            window.open(this.href, 'article-share-box-window-' + Date.now(), 'width=500,height=450');
        });
    })(jQuery);
</script>

            
    
        <a href="http://vwms.cn/2016/11/01/WMS进化论之二 – 简单 不简单/#comments" class="article-comment-link ds-thread-count" data-thread-key="http://vwms.cn/2016/11/01/WMS进化论之二 – 简单 不简单/">评论</a>
    

        </footer>-->
    </div>
    
        
<nav id="article-nav">
    
        <a href="/2016/12/22/大促之后，伤痕累累/" id="article-nav-newer" class="article-nav-link-wrap">
            <strong class="article-nav-caption">上一篇</strong>
            <div class="article-nav-title">
                
                    大促之后，伤痕累累
                
            </div>
        </a>
    
    
        <a href="/2016/10/28/WMS进化论/" id="article-nav-older" class="article-nav-link-wrap">
            <strong class="article-nav-caption">下一篇</strong>
            <div class="article-nav-title">WMS进化论</div>
        </a>
    
</nav>


    
</article>


    
    <section id="comments">
    
        
    <div class="ds-thread" data-thread-key="2016/11/01/WMS进化论之二 – 简单 不简单/" data-title="WMS进化论之二 – 简单 不简单" data-url="http://vwms.cn/2016/11/01/WMS进化论之二 – 简单 不简单/"></div>
    <style>
        #ds-thread #ds-reset .ds-textarea-wrapper {
            background: none;
        }
        #ds-reset .ds-avatar img {
            box-shadow: none;
        }
        #ds-reset .ds-gradient-bg {
            background: #f7f7f7;
        }
        #ds-thread #ds-reset li.ds-tab a {
            border-radius: 3px;
        }
        #ds-thread #ds-reset .ds-post-button {
            color: white;
            border: none;
            box-shadow: none;
            background: #d32;
            text-shadow: none;
            font-weight: normal;
            font-family: 'Microsoft Yahei';
        }
        #ds-thread #ds-reset .ds-post-button:hover {
            color: white;
            background: #DE594C;
        }
        #ds-thread #ds-reset .ds-post-button:active {
            background: #d32;
        }
        #ds-smilies-tooltip ul.ds-smilies-tabs li a.ds-current {
            color: white;
            background: #d32;
            box-shadow: none;
            text-shadow: none;
            font-weight: normal;
        }
    </style>

    
    </section>

</section>
            
                <aside id="sidebar">
   
        
    <div class="widget-wrap">
        <h3 class="widget-title">最新文章</h3>
        <div class="widget">
            <ul id="recent-post" class="">
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2017/08/15/老司机带路之全仓无纸化/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2017/08/15/老司机带路之全仓无纸化/" class="title">老司机带路之全仓无纸化</a></p>
                            <p class="item-date"><time datetime="2017-08-15T14:14:45.000Z" itemprop="datePublished">2017-08-15</time></p>
                        </div>
                    </li>
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2016/12/30/大促结束，坐等年终奖，等等，先来发年终盘点！/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2016/12/30/大促结束，坐等年终奖，等等，先来发年终盘点！/" class="title">大促结束，坐等年终奖，等等，先来发年终盘点！</a></p>
                            <p class="item-date"><time datetime="2016-12-30T11:50:54.000Z" itemprop="datePublished">2016-12-30</time></p>
                        </div>
                    </li>
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2016/12/22/大促之后，伤痕累累/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2016/12/22/大促之后，伤痕累累/" class="title">大促之后，伤痕累累</a></p>
                            <p class="item-date"><time datetime="2016-12-22T07:08:36.000Z" itemprop="datePublished">2016-12-22</time></p>
                        </div>
                    </li>
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2016/11/01/WMS进化论之二 – 简单 不简单/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2016/11/01/WMS进化论之二 – 简单 不简单/" class="title">WMS进化论之二 – 简单 不简单</a></p>
                            <p class="item-date"><time datetime="2016-11-01T03:02:52.000Z" itemprop="datePublished">2016-11-01</time></p>
                        </div>
                    </li>
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2016/10/28/WMS进化论/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2016/10/28/WMS进化论/" class="title">WMS进化论</a></p>
                            <p class="item-date"><time datetime="2016-10-28T10:49:56.000Z" itemprop="datePublished">2016-10-28</time></p>
                        </div>
                    </li>
                
            </ul>
        </div>
    </div>

    
        
    
        
    <div class="widget-wrap">
        <h3 class="widget-title">归档</h3>
        <div class="widget">
            <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/08/">八月 2017</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">十二月 2016</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a><span class="archive-list-count">2</span></li></ul>
        </div>
    </div>

    
        
    <script type="text/javascript" charset="utf-8" src="/js/tagcloud.js"></script>
    <script type="text/javascript" charset="utf-8" src="/js/tagcanvas.js"></script>
    <div class="widget-wrap">
        <h3 class="widget-title">标签</h3>
        <div id="myCanvasContainer" class="widget tagcloud">
            <canvas width="250" height="250" id="resCanvas" style="width=100%">
                <a href="/tags/SaaSWMS/" style="font-size: 20px;">SaaSWMS</a> <a href="/tags/SaaS技术/" style="font-size: 10px;">SaaS技术</a> <a href="/tags/WMS/" style="font-size: 20px;">WMS</a> <a href="/tags/仓库管理系统/" style="font-size: 20px;">仓库管理系统</a> <a href="/tags/全仓无纸化/" style="font-size: 10px;">全仓无纸化</a> <a href="/tags/双十一/" style="font-size: 10px;">双十一</a> <a href="/tags/双十二/" style="font-size: 10px;">双十二</a> <a href="/tags/大促/" style="font-size: 10px;">大促</a> <a href="/tags/年终盘点/" style="font-size: 10px;">年终盘点</a>
            </canvas>
        </div>
    </div>

    
        
    <div class="widget-wrap widget-list">
        <h3 class="widget-title">链接</h3>
        <div class="widget">
            <ul>
                
                    <li>
                        <a href="http://www.vwms.cn">vwms</a>
                    </li>
                
                    <li>
                        <a href="http://www.flux.com.cn">富勒科技</a>
                    </li>
                
                    <li>
                        <a href="http://cloud.taobao.com/">阿里聚石塔</a>
                    </li>
                
            </ul>
        </div>
    </div>


    
    <div id="toTop" class="fa fa-angle-up"></div>
</aside>
            
        </div>
        <footer id="footer">
    <div class="outer">
        <div id="footer-info" class="inner">
            &copy; 2017 vwms<br>
			<script type="text/javascript">var cnzz_protocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cspan id='cnzz_stat_icon_1259953885'%3E%3C/span%3E%3Cscript src='" + cnzz_protocol + "s4.cnzz.com/z_stat.php%3Fid%3D1259953885%26show%3Dpic1' type='text/javascript'%3E%3C/script%3E"));</script>

           <!-- Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>. Theme by <a href="http://github.com/ppoffice">PPOffice</a>-->
		   <script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
  (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
  e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');
  
  _st('install','mr8H6ZsUUwVVNWzjdxvK','2.0.0');
</script>
        </div>
    </div>
</footer>
        
    
  <script type="text/javascript">
var duoshuoQuery = {short_name:"vwms"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>



    
        <script src="/vendor/lightgallery/js/lightgallery.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-thumbnail.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-pager.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-autoplay.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-fullscreen.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-zoom.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-hash.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-share.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-video.min.js"></script>
    
    
        <script src="/vendor/justified-gallery/jquery.justifiedGallery.min.js"></script>
    



<!-- Custom Scripts -->
<script src="/js/main.js"></script>

    </div>
</body>
</html>