<!DOCTYPE html>
<html lang=zh>
<head>
    <meta charset="utf-8">
    
    <title>微仓博客</title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1" />
    <meta property="og:type" content="website">
<meta property="og:title" content="微仓博客">
<meta property="og:url" content="http://vwms.cn/index.html">
<meta property="og:site_name" content="微仓博客">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="微仓博客">
    

    
        <link rel="alternate" href="/" title="微仓博客" type="application/atom+xml" />
    

    

    <link rel="stylesheet" href="/vendor/font-awesome/css/font-awesome.min.css">
    <link rel="stylesheet" href="/vendor/open-sans/styles.css">
    <link rel="stylesheet" href="/vendor/source-code-pro/styles.css">

    <link rel="stylesheet" href="/css/style.css">

    <script src="/vendor/jquery/2.1.3/jquery.min.js"></script>
    
    
        <link rel="stylesheet" href="/vendor/lightgallery/css/lightgallery.min.css">
    
    
        <link rel="stylesheet" href="/vendor/justified-gallery/justifiedGallery.min.css">
    
    
    
    


</head>

<body>
    <div id="container">
        <header id="header">
    <div id="header-main" class="header-inner">
        <div class="outer">
            <a href="/" id="logo">
                <i class="logo"></i>
                <span class="site-title">微仓博客</span>
            </a>
            <nav id="main-nav">
                
                    <a class="main-nav-link" href="/.">首页</a>
                
                    <a class="main-nav-link" href="/archives">目录</a>
                
                    <a class="main-nav-link" href="/categories">分类</a>
                
                    <a class="main-nav-link" href="/tags">标签</a>
                
                    <a class="main-nav-link" href="/about">关于我们</a>
                
            </nav>
            
                
                <nav id="sub-nav">
                    <div class="profile" id="profile-nav">
                        <a id="profile-anchor" href="javascript:;">
                            <img class="avatar" src="/css/images/avatar.png" />
                            <i class="fa fa-caret-down"></i>
                        </a>
                    </div>
                </nav>
            
            <div id="search-form-wrap">

    <form class="search-form">
        <input type="text" class="ins-search-input search-form-input" placeholder="搜索" />
        <button type="submit" class="search-form-submit"></button>
    </form>
    <div class="ins-search">
    <div class="ins-search-mask"></div>
    <div class="ins-search-container">
        <div class="ins-input-wrapper">
            <input type="text" class="ins-search-input" placeholder="想要查找什么..." />
            <span class="ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
(function (window) {
    var INSIGHT_CONFIG = {
        TRANSLATION: {
            POSTS: '文章',
            PAGES: '页面',
            CATEGORIES: '分类',
            TAGS: '标签',
            UNTITLED: '(未命名)',
        },
        ROOT_URL: '/',
        CONTENT_URL: '/content.json',
    };
    window.INSIGHT_CONFIG = INSIGHT_CONFIG;
})(window);
</script>
<script src="/js/insight.js"></script>

</div>
        </div>
    </div>
    <div id="main-nav-mobile" class="header-sub header-inner">
        <table class="menu outer">
            <tr>
                
                    <td><a class="main-nav-link" href="/.">首页</a></td>
                
                    <td><a class="main-nav-link" href="/archives">目录</a></td>
                
                    <td><a class="main-nav-link" href="/categories">分类</a></td>
                
                    <td><a class="main-nav-link" href="/tags">标签</a></td>
                
                    <td><a class="main-nav-link" href="/about">关于我们</a></td>
                
                <td>
                    
    <div class="search-form">
        <input type="text" class="ins-search-input search-form-input" placeholder="搜索" />
    </div>

                </td>
            </tr>
        </table>
    </div>
</header>

        <div class="outer">
            
                

<aside id="profile">
    <div class="inner profile-inner">
        <div class="base-info profile-block">
            <img id="avatar" src="/css/images/avatar.png" />
            <h2 id="name">PPOffice</h2>
            <h3 id="title">Web Developer &amp; Designer</h3>
            <span id="location"><i class="fa fa-map-marker"></i>Harbin, China</span>
            <a id="follow" target="_blank" href="https://github.com/ppoffice/">关注我</a>
        </div>
        <div class="article-info profile-block">
            <div class="article-info-block">
                3
                <span>文章</span>
            </div>
            <div class="article-info-block">
                0
                <span>标签</span>
            </div>
        </div>
        
        <div class="profile-block social-links">
            <table>
                <tr>
                    
                    
                    <td>
                        <a href="http://github.com/ppoffice/hexo-theme-icarus" target="_blank" title="github" class=tooltip>
                            <i class="fa fa-github"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="twitter" class=tooltip>
                            <i class="fa fa-twitter"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="facebook" class=tooltip>
                            <i class="fa fa-facebook"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="dribbble" class=tooltip>
                            <i class="fa fa-dribbble"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="rss" class=tooltip>
                            <i class="fa fa-rss"></i>
                        </a>
                    </td>
                    
                </tr>
            </table>
        </div>
        
    </div>
</aside>

            
            <section id="main">
    <article id="post-WMS进化论之二 – 简单 不简单" class="article article-type-post" itemscope itemprop="blogPost">
    <div class="article-inner">
        
        
            <header class="article-header">
                
    
        <h1 itemprop="name">
            <a class="article-title" href="/2016/10/25/WMS进化论之二 – 简单 不简单/">WMS进化论之二 – 简单 不简单</a>
        </h1>
    

                
                    <div class="article-meta">
                        
    <div class="article-date">
        <i class="fa fa-calendar"></i>
        <a href="/2016/10/25/WMS进化论之二 – 简单 不简单/">
            <time datetime="2016-10-25T09:10:43.000Z" itemprop="datePublished">2016-10-25</time>
        </a>
    </div>


                        
                        
                    </div>
                
            </header>
        
        
        <div class="article-entry" itemprop="articleBody">
        
            
            <p>&#x81EA;&#x4ECE;&#x4E0A;&#x6B21;&#x63D0;&#x51FA;&#x4E86;WMS&#x8FDB;&#x5316;&#x8BBA;&#xFF0C;&#x7ED3;&#x679C;&#x88AB;&#x597D;&#x53CB;&#x8C03;&#x4F83;&#xFF0C;&#x201C;&#x4F60;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;SaaS&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x662F;&#x6280;&#x672F;&#x672C;&#x8EAB;&#x5E26;&#x6765;&#x7684;&#x9769;&#x547D;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x7528;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4EA7;&#x54C1;&#x90FD;&#x5177;&#x5907;&#x8FD9;&#x4E9B;&#xFF0C;&#x5FAE;&#x4ED3;&#x8FD8;&#x6709;&#x522B;&#x7684;&#x5417;&#xFF1F;&#x201D;&#x597D;&#x5427;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x5C31;&#x6765;&#x804A;&#x70B9;&#x522B;&#x7684;&#x3002;<br>&#xFF08;&#x6E29;&#x99A8;&#x63D0;&#x793A;&#xFF1A;&#x524D;&#x65B9;&#x591A;&#x56FE;&#xFF09;</p>
<p><strong>&#x5728;&#x6B63;&#x5F0F;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x770B;&#x5F20;&#x56FE;&#xFF1A;</strong></p>
<p><img src="http://oflf20p0h.bkt.clouddn.com/1.jpg" alt=""></p>
<p><strong>&#x518D;&#x6765;&#x4E00;&#x4E2A;&#xFF0C;</strong></p>
<p><img src="http://oflf20p0h.bkt.clouddn.com/2.jpg" alt=""></p>
<p><strong>&#x5927;&#x5BB6;&#x4EC0;&#x4E48;&#x611F;&#x53D7;&#xFF1F;&#x597D;&#x4E13;&#x4E1A;&#xFF1F;&#x597D;&#x5F3A;&#x5927;&#xFF1F;&#x529F;&#x80FD;&#x597D;&#x591A;&#x597D;&#x590D;&#x6742;&#xFF1F;&#x8FD9;&#x5957;&#x7CFB;&#x7EDF;&#x4E0D;&#x7B80;&#x5355;&#xFF1F;</strong></p>
<p>&#x73B0;&#x5728;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x4F53;&#x4F1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4F20;&#x7EDF;&#x7269;&#x6D41;&#x8F6F;&#x4EF6;&#x4F01;&#x4E1A;&#x4E0D;&#x613F;&#x610F;&#x8BA9;&#x7528;&#x6237;&#x8BD5;&#x7528;&#x4E86;&#x5417;&#xFF1F;&#x4F60;&#x8BF4;&#x8FD9;&#x6837;&#x7684;&#x529F;&#x80FD;&#x548C;&#x754C;&#x9762;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x7ED9;&#x7528;&#x6237;&#x89E3;&#x91CA;&#x6E05;&#x695A;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x5C11;&#x4E13;&#x4E1A;&#x7ECF;&#x9A8C;&#xFF0C;&#x624D;&#x80FD;&#x5F04;&#x660E;&#x767D;&#x8FD9;&#x4E9B;&#x52FE;&#x52FE;&#x9009;&#x9009;&#x662F;&#x795E;&#x9A6C;&#x610F;&#x601D;&#x3002;</p>
<p>&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x7ED9;&#x4E13;&#x4E1A;&#x7528;&#x6237;&#x7528;&#x7684;&#xFF0C;&#x4F5C;&#x4E3A;SaaS&#x7684;&#x4E3B;&#x8981;&#x53D7;&#x4F17;&#x5927;&#x591A;&#x6570;&#x4E2D;&#x5C0F;&#x4F01;&#x4E1A;&#x4ECE;&#x4E1A;&#x8005;&#x800C;&#x8A00;&#xFF0C;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x7CBE;&#x529B;&#x53BB;&#x7814;&#x7A76;&#x53BB;&#x7406;&#x89E3;&#x4F60;&#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#xFF0C;&#x4ED6;&#x4EEC;&#x66F4;&#x9700;&#x8981;&#x4E00;&#x5957;&#x4EBA;&#x6027;&#x5316;&#x7B80;&#x7EA6;&#x9AD8;&#x6548;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E3E;&#x4E2A;&#x6817;&#x5B50;&#xFF0C;&#x8FD9;&#x662F;&#x67D0;&#x5BA2;&#x6237;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x590D;&#x6838;&#x9875;&#x9762;&#xFF1A;</p>
<p><img src="http://oflf20p0h.bkt.clouddn.com/3.jpg" alt=""></p>
<p><strong>&#x8FD9;&#x4E2A;&#x662F;&#x6211;&#x4EEC;&#x4EA7;&#x54C1;&#x76EE;&#x524D;&#x7684;&#x590D;&#x6838;&#x9875;&#x9762;&#xFF1A;</strong></p>
<p><img src="http://oflf20p0h.bkt.clouddn.com/4.jpg" alt=""></p>
<p><strong>&#x4F60;&#x8981;&#x95EE;&#x6211;&#x8FD9;&#x4E24;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x6211;&#x53EA;&#x80FD;&#x8BF4;&#xFF0C;&#x8C01;&#x7528;&#x8C01;&#x77E5;&#x9053;&#x3002;</strong></p>
<p>&#x5728;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x7B79;&#x5907;&#x505A;&#x8FD9;&#x5957;&#x4EA7;&#x54C1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x539F;&#x5219;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x7528;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x6765;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x548C;&#x8BBE;&#x8BA1;WMS&#x4EA7;&#x54C1;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x7528;&#x6237;&#x9700;&#x6C42;&#x3001;&#x884C;&#x4E3A;&#x3001;&#x611F;&#x53D7;&#x3001;&#x60C5;&#x7EEA;&#x3001;&#x75DB;&#x70B9;&#x7B49;&#x7528;&#x6237;&#x573A;&#x666F;&#x5E76;&#x6309;&#x5BA2;&#x6237;&#x65C5;&#x7A0B;&#x56FE;&#x6765;&#x505A;&#x6D41;&#x7A0B;&#x8BBE;&#x8BA1;&#x7684;&#x6307;&#x5BFC;&#xFF0C;&#x5C06;&#x6BCF;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x73AF;&#x8282;&#x548C;&#x64CD;&#x4F5C;&#x8282;&#x70B9;&#x91CD;&#x65B0;&#x68B3;&#x7406;&#xFF0C;&#x6253;&#x9020;&#x4E00;&#x5957;&#x771F;&#x6B63;&#x8BA9;&#x7528;&#x6237;&#x7528;&#x7684;&#x723D;&#x7684;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x4EE5;&#x4E0A;&#x539F;&#x5219;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5728;&#x590D;&#x6838;&#x9875;&#x9762;&#x4E2D;&#x4F5C;&#x4E1A;&#x4EBA;&#x5458;&#x66F4;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x8BA2;&#x5355;&#x4E2D;&#x7684;&#x5546;&#x54C1;&#x548C;&#x6570;&#x91CF;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x66F4;&#x591A;&#x65F6;&#x5019;&#x590D;&#x6838;&#x53F0;&#x90FD;&#x662F;&#x7528;&#x7684;&#x53F0;&#x5F0F;&#x673A;&#xFF0C;&#x79BB;&#x7528;&#x6237;&#x89C6;&#x7EBF;&#x8F83;&#x8FDC;&#xFF0C;&#x4ED3;&#x5E93;&#x4E2D;&#x7684;&#x5149;&#x7EBF;&#x8F83;&#x6697;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x9AD8;&#x4EAE;&#x7684;&#x989C;&#x8272;&#x548C;&#x58F0;&#x97F3;&#x6765;&#x63D0;&#x793A;&#x7528;&#x6237;&#x4F5C;&#x4E1A;&#x4E2D;&#x7684;&#x6B63;&#x5E38;&#x4E0E;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x53EA;&#x7ED9;&#x5230;&#x73B0;&#x573A;&#x4EBA;&#x5458;&#x4ED6;/&#x5979;&#x6700;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x800C;&#x5173;&#x4E8E;&#x8FD0;&#x5355;&#x3001;&#x53D1;&#x7968;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x7684;&#x4EBA;&#x5458;&#x72EC;&#x7ACB;&#x7684;&#x6D41;&#x7A0B;&#x6765;&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x5E72;&#x561B;&#x4E0D;&#x7528;&#x5355;&#x72EC;&#x7684;&#x754C;&#x9762;&#x5904;&#x7406;&#x5462;&#xFF1F;</p>
<p>&#x4E5F;&#x8BB8;&#x6709;&#x4EBA;&#x4F1A;&#x8BF4;&#xFF0C;&#x4F01;&#x4E1A;&#x8F6F;&#x4EF6;&#x5929;&#x7136;&#x6709;&#x4E2A;&#x7279;&#x70B9;&#x4F60;&#x4EEC;&#x5FFD;&#x7565;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x5BA2;&#x6237;&#x8DDF;&#x7528;&#x6237;&#x4E0D;&#x662F;&#x4E00;&#x62E8;&#x4EBA;&#xFF0C;&#x82B1;&#x94B1;&#x7684;&#x4EBA;&#x4E0D;&#x4F1A;&#x53BB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x8BBE;&#x8BA1;&#x518D;&#x597D;&#x4E5F;&#x6CA1;&#x7528;&#x3002;&#x82B1;&#x94B1;&#x7684;&#x4EBA;&#x53EA;&#x5173;&#x6CE8;&#x4EEA;&#x8868;&#x76D8;&#xFF0C;&#x5173;&#x6CE8;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x3002;&#x522B;&#x6025;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4EEA;&#x8868;&#x76D8;&#xFF0C;1.0&#x7248;&#x672C;&#x7684;&#x4EEA;&#x8868;&#x76D8;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p><img src="http://oflf20p0h.bkt.clouddn.com/5.jpg" alt=""></p>
<p><strong>&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x5982;&#x4F55;&#x5E2E;&#x7528;&#x6237;&#x5B9E;&#x73B0;&#x529F;&#x80FD;&#xFF0C;&#x66F4;&#x5173;&#x6CE8;&#x5982;&#x4F55;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x66F4;&#x597D;&#xFF0C;&#x4E00;&#x4E2A;&#x987A;&#x624B;&#x7684;&#x5DE5;&#x5177;&#x9700;&#x8981;&#x5177;&#x5907;&#x4E0A;&#x624B;&#x5FEB;&#xFF0C;&#x6613;&#x64CD;&#x4F5C;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x800C;&#x770B;&#x8D77;&#x6765;&#x7B80;&#x5355;&#x5C31;&#x662F;&#x5FC5;&#x987B;&#x8981;&#x8FFD;&#x6C42;&#x7684;&#x76EE;&#x6807;&#x3002;</strong></p>
<p>&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5F88;&#x591A;&#x4EBA;&#x6765;&#x8BD5;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x7ECF;&#x5E38;&#x63A5;&#x5230;&#x7535;&#x8BDD;&#x8BF4;&#x4F60;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x770B;&#x8D77;&#x6765;&#x597D;&#x7B80;&#x5355;&#xFF1F;&#x6211;&#x53EA;&#x80FD;&#x8BF4;&#xFF0C;&#x7B80;&#x5355;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8FFD;&#x6C42;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x518D;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x770B;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x201C;&#x7B80;&#x5355;&#x201D;&#x7684;&#x7CFB;&#x7EDF;&#x80FD;&#x5426;&#x6EE1;&#x8DB3;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x3002;</p>
<p><strong>&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x4E3A;&#x4E86;&#x8BA9;&#x7528;&#x6237;&#x89C9;&#x5F97;&#x4E13;&#x4E1A;&#x800C;&#x5F00;&#x653E;&#x5927;&#x91CF;&#x7528;&#x6237;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x7684;&#x914D;&#x7F6E;&#x5F00;&#x5173;&#x7ED9;&#x4ED6;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x61D2;&#x60F0;&#x800C;&#x4E0D;&#x5206;&#x573A;&#x666F;&#x7684;&#x628A;&#x6240;&#x6709;&#x5B57;&#x6BB5;&#x5806;&#x5728;&#x4E00;&#x4E2A;&#x8868;&#x683C;&#x91CC;&#x8BA9;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x7FFB;&#x627E;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x6280;&#x672F;&#x96BE;&#x5EA6;&#x800C;&#x6446;&#x4E00;&#x5806;&#x67E5;&#x8BE2;&#x548C;&#x7B5B;&#x9009;&#x6761;&#x4EF6;&#x51FA;&#x6765;&#xFF0C;&#x4E00;&#x4E2A;&#x5168;&#x6587;&#x68C0;&#x7D22;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x6240;&#x6709;&#x67E5;&#x8BE2;&#xFF0C;&#x4E00;&#x4E2A;&#x4E0B;&#x62C9;&#x7BAD;&#x5934;&#x53EF;&#x4EE5;&#x7B5B;&#x9009;&#x51FA;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF1B;&#x6211;&#x4EEC;&#x4F1A;&#x5173;&#x6CE8;&#x6BCF;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x5173;&#x6CE8;&#x6BCF;&#x4E00;&#x4E2A;&#x8868;&#x683C;&#xFF0C;&#x5173;&#x6CE8;&#x6BCF;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x505A;&#x5230;&#x5B8C;&#x7F8E;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x5728;&#x52AA;&#x529B;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x4F1A;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x5FEB;&#x7684;&#x6210;&#x957F;&#xFF01;</strong><br><img src="http://oflf20p0h.bkt.clouddn.com/6.jpg" alt=""></p>

        
        </div>
        <footer class="article-footer">
            <div class="share-container">



</div>

    <a data-url="http://vwms.cn/2016/10/25/WMS进化论之二 – 简单 不简单/" data-id="ciupcji2i000031p5r2ace6s5" class="article-share-link"><i class="fa fa-share"></i>分享到</a>
<script>
    (function ($) {
        // Prevent duplicate binding
        if (typeof(__SHARE_BUTTON_BINDED__) === 'undefined' || !__SHARE_BUTTON_BINDED__) {
            __SHARE_BUTTON_BINDED__ = true;
        } else {
            return;
        }
        $('body').on('click', function() {
            $('.article-share-box.on').removeClass('on');
        }).on('click', '.article-share-link', function(e) {
            e.stopPropagation();

            var $this = $(this),
                url = $this.attr('data-url'),
                encodedUrl = encodeURIComponent(url),
                id = 'article-share-box-' + $this.attr('data-id'),
                offset = $this.offset(),
                box;

            if ($('#' + id).length) {
                box = $('#' + id);

                if (box.hasClass('on')){
                    box.removeClass('on');
                    return;
                }
            } else {
                var html = [
                    '<div id="' + id + '" class="article-share-box">',
                        '<input class="article-share-input" value="' + url + '">',
                        '<div class="article-share-links">',
                            '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="fa fa-twitter article-share-twitter" target="_blank" title="Twitter"></a>',
                            '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="fa fa-facebook article-share-facebook" target="_blank" title="Facebook"></a>',
                            '<a href="http://pinterest.com/pin/create/button/?url=' + encodedUrl + '" class="fa fa-pinterest article-share-pinterest" target="_blank" title="Pinterest"></a>',
                            '<a href="https://plus.google.com/share?url=' + encodedUrl + '" class="fa fa-google article-share-google" target="_blank" title="Google+"></a>',
                        '</div>',
                    '</div>'
                ].join('');

              box = $(html);

              $('body').append(box);
            }

            $('.article-share-box.on').hide();

            box.css({
                top: offset.top + 25,
                left: offset.left
            }).addClass('on');

        }).on('click', '.article-share-box', function (e) {
            e.stopPropagation();
        }).on('click', '.article-share-box-input', function () {
            $(this).select();
        }).on('click', '.article-share-box-link', function (e) {
            e.preventDefault();
            e.stopPropagation();

            window.open(this.href, 'article-share-box-window-' + Date.now(), 'width=500,height=450');
        });
    })(jQuery);
</script>

            
    
        <a href="http://vwms.cn/2016/10/25/WMS进化论之二 – 简单 不简单/#comments" class="article-comment-link disqus-comment-count" data-disqus-url="http://vwms.cn/2016/10/25/WMS进化论之二 – 简单 不简单/">评论</a>
    

        </footer>
    </div>
    
</article>



    <article id="post-WMS进化论" class="article article-type-post" itemscope itemprop="blogPost">
    <div class="article-inner">
        
        
            <header class="article-header">
                
    
        <h1 itemprop="name">
            <a class="article-title" href="/2016/10/25/WMS进化论/">WMS进化论</a>
        </h1>
    

                
                    <div class="article-meta">
                        
    <div class="article-date">
        <i class="fa fa-calendar"></i>
        <a href="/2016/10/25/WMS进化论/">
            <time datetime="2016-10-25T08:45:40.000Z" itemprop="datePublished">2016-10-25</time>
        </a>
    </div>


                        
                        
                    </div>
                
            </header>
        
        
        <div class="article-entry" itemprop="articleBody">
        
            
            <p><img src="http://oflf20p0h.bkt.clouddn.com/640.jpg" alt=""><br>&#x4E0A;&#x6B21;&#x7684;&#x6587;&#x7AE0;&#x91CC;&#x63D0;&#x5230;&#x4E86;WMS 2.0&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E4B;&#x540E;&#x5F88;&#x591A;&#x670B;&#x53CB;&#x95EE;&#x662F;&#x4E0D;&#x662F;&#x4F60;&#x4EEC;&#x53D1;&#x5E03;&#x4E86;2.0&#x7248;&#x672C;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x770B;&#x6765;&#xFF0C; 2.0&#x662F;&#x533A;&#x522B;&#x4E8E;&#x73B0;&#x6709;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x4EE5;SaaS&#x6280;&#x672F;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x65B0;&#x4E00;&#x4EE3;WMS&#x4EA7;&#x54C1;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x4EA7;&#x54C1;&#x9700;&#x8981;&#x5177;&#x5907;&#x5982;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</p>
<p><strong>&#x6539;&#x53D8;&#x4E86;&#x8D39;&#x6536;&#x6A21;&#x578B;&#xFF0C;&#x6536;&#x5165;&#x6A21;&#x5F0F;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;</strong><br><img src="http://oflf20p0h.bkt.clouddn.com/6401.jpg" alt=""><br>&#x6309;&#x4ED3;&#x5E93;&#x3001;&#x7528;&#x6237;&#x6570;&#x4E3A;&#x57FA;&#x51C6;&#x7684;&#x8F6F;&#x4EF6;&#x6388;&#x6743;&#x8D39;&#x7528;&#xFF1B;&#x4EE5;&#x4EBA;&#x5929;&#x8BA1;&#x4EF7;&#x7684;&#x5B9E;&#x65BD;&#x548C;&#x4E8C;&#x6B21;&#x5F00;&#x53D1;&#x8D39;&#x7528;&#x4EE5;&#x53CA;&#x6309;&#x524D;&#x4E24;&#x8005;&#x4E00;&#x5B9A;&#x6BD4;&#x4F8B;(15%~25%)&#x8BA1;&#x6536;&#x7684;&#x5E74;&#x5EA6;&#x8F6F;&#x4EF6;&#x7EF4;&#x62A4;&#x8D39;&#x662F;&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x8425;&#x6536;&#x7684;&#x4E09;&#x79CD;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x3002;</p>
<p>&#x800C;&#x4F5C;&#x4E3A;SaaS&#x8F6F;&#x4EF6;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x663E;&#x8457;&#x7279;&#x70B9;&#x5373;&#x5C06;&#x8F6F;&#x4EF6;&#x6388;&#x6743;&#x8D39;&#x7528;&#x7531;&#x4E70;&#x65AD;&#x6539;&#x4E3A;&#x79DF;&#x7528;&#xFF0C;&#x5C06;&#x4F01;&#x4E1A;&#x4E00;&#x6B21;&#x6027;&#x7684;IT&#x9884;&#x7B97;&#x53EF;&#x4EE5;&#x957F;&#x671F;&#x7684;&#x5206;&#x591A;&#x6B21;&#x652F;&#x4ED8;&#xFF0C;&#x540C;&#x65F6;&#x53D6;&#x6D88;&#x4E86;&#x5B9E;&#x65BD;&#x548C;&#x7EF4;&#x62A4;&#x8D39;&#x7528;&#xFF0C;&#x5927;&#x5E45;&#x964D;&#x4F4E;&#x4E86;&#x8F6F;&#x4EF6;&#x91C7;&#x8D2D;&#x6210;&#x672C;&#x3002;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x539F;&#x6765;&#x4F60;&#x4E70;&#x4E00;&#x5957;WMS&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x642D;&#x5EFA;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x52A8;&#x8F84;&#x51E0;&#x4E07;&#x51E0;&#x5341;&#x4E07;&#x7684;&#x670D;&#x52A1;&#x5668;&#x786C;&#x4EF6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x6210;&#x672C;&#xFF0C;&#x8FD9;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x8FD8;&#x8981;&#x96C7;IT&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x548C;&#x7EF4;&#x62A4;&#xFF0C;&#x5907;&#x4EFD;&#x3001;&#x6740;&#x6BD2;&#x3001;&#x8FD0;&#x7EF4;&#x76D1;&#x63A7;&#x65E0;&#x4E00;&#x4E0D;&#x9700;&#x8981;&#x6210;&#x672C;&#x6295;&#x5165;&#x3002;&#x5728;SaaS&#x65F6;&#x4EE3;&#xFF0C;&#x8FD9;&#x4E9B;&#x6210;&#x672C;&#x662F;&#x5927;&#x5E45;&#x524A;&#x51CF;&#x7684;&#xFF0C;&#x4F01;&#x4E1A;&#x6CE8;&#x518C;&#x5F00;&#x901A;&#x540E;&#x76F4;&#x63A5;&#x6253;&#x5F00;&#x7F51;&#x9875;&#x5373;&#x53EF;&#x4F7F;&#x7528;&#x8F6F;&#x4EF6;&#xFF0C;&#x65E0;&#x987B;&#x64CD;&#x5FC3;&#x670D;&#x52A1;&#x5668;&#x91C7;&#x8D2D;&#x548C;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5FAE;&#x8F6F;&#x3001;&#x7532;&#x9AA8;&#x6587;&#x54EA;&#x5929;&#x627E;&#x4E0A;&#x95E8;&#x6765;&#x6536;&#x53D6;&#x8BB8;&#x53EF;&#x8D39;&#x7528;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x4EA4;&#x7ED9;SaaS&#x670D;&#x52A1;&#x5546;&#x6765;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;&#xFF0C;&#x5206;&#x5DE5;&#x4EA7;&#x751F;&#x6548;&#x80FD;&#xFF0C;&#x4E13;&#x4E1A;&#x4EA7;&#x751F;&#x6548;&#x7387;&#xFF0C;&#x8FD9;&#x4E2A;&#x6210;&#x672C;&#x4E00;&#x5B9A;&#x662F;&#x6BD4;&#x4F01;&#x4E1A;&#x81EA;&#x5DF1;&#x7BA1;&#x7406;&#x4F4E;&#x3002;</p>
<p><strong>&#x5148;&#x5C1D;&#x540E;&#x4E70;&#xFF0C;&#x6309;&#x9700;&#x91C7;&#x8D2D;&#xFF0C;&#x968F;&#x4E70;&#x968F;&#x7528;</strong><br><img src="http://oflf20p0h.bkt.clouddn.com/6402.jpg" alt=""><br>&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x7684;&#x9500;&#x552E;&#x65B9;&#x5F0F;&#x662F;&#x7531;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x9500;&#x552E;&#x548C;&#x987E;&#x95EE;&#x7ECF;&#x8FC7;&#x524D;&#x671F;&#x6C9F;&#x901A;&#x3001;&#x73B0;&#x573A;&#x8C03;&#x7814;&#x3001;&#x6848;&#x4F8B;&#x53C2;&#x89C2;&#x3001;&#x65B9;&#x6848;&#x8BB2;&#x89E3;&#x7B49;&#x73AF;&#x8282;&#x8BA9;&#x5BA2;&#x6237;&#x4E86;&#x89E3;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x80FD;&#x529B;&#x548C;&#x4EA7;&#x54C1;&#xFF0C;&#x4F46;&#x5F80;&#x5F80;&#x7531;&#x4E8E;&#x5468;&#x671F;&#x8FC7;&#x957F;&#x4EE5;&#x53CA;&#x5BA2;&#x6237;&#x5BF9;&#x552E;&#x524D;&#x4EBA;&#x5458;&#x7684;&#x4FE1;&#x4EFB;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x8FDE;&#x8F6F;&#x4EF6;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x90FD;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x5C31;&#x7B7E;&#x8BA2;&#x4E86;&#x8D2D;&#x4E70;&#x5408;&#x540C;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x4EA7;&#x54C1;&#x8DDF;&#x4E1A;&#x52A1;&#x7684;&#x5951;&#x5408;&#x5EA6;&#x3001;&#x64CD;&#x4F5C;&#x7684;&#x6D41;&#x7545;&#x6027;&#x548C;&#x4EA4;&#x4E92;&#x7684;&#x53CB;&#x597D;&#x6027;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x7CFB;&#x7EDF;&#x8981;&#x57F9;&#x8BAD;&#x4E0A;&#x7EBF;&#x4E86;&#x751A;&#x81F3;&#x5728;&#x4E0A;&#x7EBF;&#x4E4B;&#x540E;&#xFF0C;&#x5BA2;&#x6237;&#x624D;&#x53D1;&#x73B0;&#x6709;&#x4E9B;&#x64CD;&#x4F5C;&#x4E60;&#x60EF;&#x548C;&#x529F;&#x80FD;&#x7EC6;&#x8282;&#x9700;&#x8981;&#x6539;&#x8FDB;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F9B;&#x5E94;&#x5546;&#x6536;&#x4F60;&#x4E2A;&#x670D;&#x52A1;&#x8BA2;&#x5355;&#xFF0C;&#x52A0;&#x70B9;&#x4EBA;&#x5929;&#x8D39;&#x662F;&#x6B63;&#x5E38;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6536;&#x8D39;&#xFF0C;&#x90A3;&#x662F;&#x826F;&#x5FC3;&#x3002;&#x4E1A;&#x5185;&#x67D0;&#x670D;&#x88C5;&#x7269;&#x6D41;&#x4E2D;&#x5FC3;&#x5C31;&#x66FE;&#x7ECF;&#x5728;&#x4E0A;&#x7EBF;&#x540E;&#x589E;&#x52A0;&#x4E86;400&#x591A;&#x4EBA;&#x5929;&#x7684;&#x670D;&#x52A1;&#x8BA2;&#x5355;&#xFF0C;&#x4F60;&#x8BF4;&#x8FD9;&#x662F;&#x8C01;&#x7684;&#x8FC7;&#xFF1F;</p>
<p>SaaS WMS&#x4ECE;&#x91C7;&#x8D2D;&#x6A21;&#x5F0F;&#x4E0A;&#x89C4;&#x907F;&#x4E86;&#x5982;&#x4E0A;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x5BA2;&#x6237;&#x5728;&#x8D2D;&#x4E70;&#x4E4B;&#x524D;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x7EBF;&#x8BD5;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x4EA7;&#x54C1;&#x7684;&#x529F;&#x80FD;&#x7EC6;&#x8282;&#x548C;&#x64CD;&#x4F5C;&#x6D41;&#x7A0B;&#xFF0C;&#x6EE1;&#x610F;&#x4E86;&#x518D;&#x4E70;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x597D;&#xFF0C;&#x6389;&#x5934;&#x5C31;&#x8D70;&#x561B;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x5F00;&#x901A;&#x4E86;&#x6B63;&#x5F0F;&#x7528;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7528;&#x4E0B;&#x6765;&#x89C9;&#x5F97;&#x4E0D;&#x597D;&#x7528;&#xFF0C;&#x8DF3;&#x51FA;&#x6210;&#x672C;&#x4E5F;&#x662F;&#x6781;&#x4F4E;&#x7684;&#xFF0C;&#x6362;&#x5957;&#x7CFB;&#x7EDF;&#x4E5F;&#x5C31;&#x662F;&#x51E0;&#x5929;&#x7684;&#x529F;&#x592B;&#xFF1B;&#x4F20;&#x7EDF;&#x6A21;&#x5F0F;&#x4F60;&#x8BD5;&#x8BD5;&#xFF0C;&#x82B1;&#x4E86;&#x51E0;&#x5341;&#x4E07;&#x4E0A;&#x767E;&#x4E07;&#x4E70;&#x5957;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E0A;&#x7EBF;&#x4E86;&#x4F60;&#x89C9;&#x5F97;&#x4E0D;&#x597D;&#x7528;&#xFF0C;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x9884;&#x671F;&#x6548;&#x679C;&#xFF0C;&#x4F60;&#x8DDF;&#x8001;&#x677F;&#x8BF4;&#x6211;&#x60F3;&#x6362;&#x4E86;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x662F;&#x4F9B;&#x5E94;&#x5546;&#x4F1A;&#x9000;&#x94B1;&#x7ED9;&#x4F60;&#x8FD8;&#x662F;&#x8001;&#x677F;&#x780D;&#x4E86;&#x4F60;&#xFF1F;&#x8001;&#x5B9E;&#x7684;&#x7EE7;&#x7EED;&#x5FCD;&#x8FB1;&#x8D1F;&#x91CD;&#x8DDF;&#x4F9B;&#x5E94;&#x5546;&#x6597;&#x667A;&#x6597;&#x52C7;&#x5427;&#xFF0C;&#x4E0A;&#x8F66;&#x5BB9;&#x6613;&#x4E0B;&#x8F66;&#x96BE;&#x554A;&#x3002;</p>
<p>SaaS&#x65E0;&#x8BBA;&#x662F;&#x6309;&#x65F6;&#x957F;&#x8FD8;&#x662F;&#x6309;&#x6D41;&#x91CF;&#xFF0C;&#x4EFB;&#x4F55;&#x8BA1;&#x8D39;&#x65B9;&#x5F0F;&#x90FD;&#x662F;&#x6E05;&#x6670;&#x53EF;&#x8861;&#x91CF;&#x7684;&#xFF0C;&#x7528;&#x7684;&#x591A;&#x6210;&#x672C;&#x9AD8;&#xFF0C;&#x7528;&#x7684;&#x5C11;&#x6210;&#x672C;&#x4F4E;&#xFF0C;&#x4E5F;&#x90FD;&#x662F;&#x516C;&#x5F00;&#x548C;&#x900F;&#x660E;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x4F01;&#x4E1A;&#x7684;&#x4EF7;&#x683C;&#x90FD;&#x662F;&#x5728;&#x5B98;&#x7F51;&#x516C;&#x5F00;&#x7684;&#xFF08;&#x76EE;&#x524D;Vwms&#x7684;&#x4EF7;&#x683C;&#x65B9;&#x6848;&#x4F1A;&#x5728;&#x6CE8;&#x518C;&#x540E;&#x90AE;&#x4EF6;&#x7ED9;&#x5BA2;&#x6237;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x4F60;&#x91C7;&#x8D2D;&#x4EBA;&#x5458;&#x7684;&#x8BAE;&#x4EF7;&#x80FD;&#x529B;&#x5403;&#x4E8F;&#x6216;&#x8005;&#x5360;&#x4FBF;&#x5B9C;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x540C;&#x6837;&#x89C4;&#x6A21;&#x7684;&#x4E24;&#x5BB6;&#x4F01;&#x4E1A;&#x4E70;&#x4E00;&#x5957;&#x8F6F;&#x4EF6;&#x82B1;&#x8D39;&#x5DEE;&#x4E00;&#x500D;&#x7684;&#x60C5;&#x51B5;&#x3002;Vwms&#x6309;&#x51FA;&#x5E93;&#x5355;&#x91CF;&#x8BA1;&#x8D39;&#xFF0C;&#x6BCF;&#x53D1;&#x4E00;&#x4E2A;&#x5305;&#x88F9;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x6E05;&#x6670;&#x7684;&#x6838;&#x7B97;&#x5728;&#x8FD9;&#x4E2A;&#x5305;&#x88F9;&#x4E0A;&#x4EA7;&#x751F;&#x7684;&#x8F6F;&#x4EF6;&#x8D39;&#x7528;&#xFF0C;&#x8DDF;&#x4F60;&#x7684;&#x5305;&#x88C5;&#x8017;&#x6750;&#x4E00;&#x6837;&#x4EF7;&#x683C;&#x6E05;&#x6670;&#xFF0C;&#x9884;&#x7B97;&#x53EF;&#x63A7;&#x3002;</p>
<p><strong>&#x6C34;&#x5E73;&#x6269;&#x5C55;&#xFF0C;&#x968F;&#x65F6;&#x6269;&#x5BB9;</strong><br>&#x4F20;&#x7EDF;&#x65F6;&#x4EE3;&#x4F01;&#x4E1A;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x5CF0;&#x503C;&#x7684;&#x4E1A;&#x52A1;&#x538B;&#x529B;&#xFF0C;&#x4F1A;&#x6309;&#x6700;&#x5927;&#x503C;&#x8FDB;&#x884C;&#x8BBE;&#x5907;&#x91C7;&#x8D2D;&#xFF0C;&#x8D85;&#x5BB9;&#x91CF;&#x6765;&#x8D2D;&#x4E70;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x53CC;&#x5341;&#x4E00;&#x7684;&#x7CFB;&#x7EDF;&#x538B;&#x529B;&#xFF0C;&#x591A;&#x82B1;&#x4E86;&#x51E0;&#x500D;&#x7684;&#x6210;&#x672C;&#x914D;&#x7F6E;&#x9AD8;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x800C;&#x5E73;&#x65F6;&#x4EC5;&#x7528;&#x5230;&#x6027;&#x80FD;&#x7684;15%~20%&#x3002;SaaS WMS&#x63D0;&#x4F9B;&#x4E86;&#x7CFB;&#x7EDF;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5E73;&#x65F6;&#x65E5;&#x5747;500&#x5355;&#xFF0C;&#x4F60;&#x7528;4G&#x5185;&#x5B58;&#xFF0C;2M&#x5E26;&#x5BBD;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5F53;&#x5927;&#x4FC3;&#x9AD8;&#x5CF0;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E34;&#x65F6;&#x589E;&#x52A0;&#x5230;20G&#x5185;&#x5B58;&#xFF0C;10M&#x5E26;&#x5BBD;&#x6EE1;&#x8DB3;&#x4F60;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x5904;&#x7406;&#x9700;&#x6C42;&#xFF0C;&#x9AD8;&#x5CF0;&#x8FC7;&#x53BB;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x91CA;&#x653E;&#x8FD9;&#x4E9B;&#x589E;&#x52A0;&#x7684;&#x5185;&#x5B58;&#x548C;&#x5E26;&#x5BBD;&#x8D44;&#x6E90;&#xFF0C;&#x5373;&#x8282;&#x7701;&#x4E86;&#x4E91;&#x7A7A;&#x95F4;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x53C8;&#x7701;&#x4E86;&#x6210;&#x672C;&#x3002;&#x5171;&#x4EAB;&#x7ECF;&#x6D4E;&#x65F6;&#x4EE3;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x5668;&#x8FD8;&#x662F;&#x72EC;&#x4EAB;&#x7684;&#xFF0C;&#x4F60;&#x4E0D;&#x89C9;&#x5F97;&#x6D6A;&#x8D39;&#x5417;&#xFF1F;</p>
<p>&#x5F53;&#x7136;&#xFF0C;SaaS&#x7684;&#x4F18;&#x52BF;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x63A2;&#x7D22;&#x5982;&#x4F55;&#x6253;&#x9020;&#x66F4;&#x4EBA;&#x6027;&#x5316;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x66F4;&#x5FEB;&#x66F4;&#x6781;&#x81F4;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x8BA9;&#x6BCF;&#x4E00;&#x4E2A;&#x7269;&#x6D41;&#x4EBA;&#x6709;&#x66F4;&#x987A;&#x624B;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p>WMS 2.0&#x65F6;&#x4EE3;&#x5DF2;&#x7ECF;&#x5230;&#x6765;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x62E5;&#x62B1;&#x6539;&#x53D8;&#xFF0C;&#x671F;&#x5F85;&#x4E00;&#x4E2A;&#x66F4;&#x7F8E;&#x7684;&#x672A;&#x6765;&#xFF01;</p>

        
        </div>
        <footer class="article-footer">
            <div class="share-container">



</div>

    <a data-url="http://vwms.cn/2016/10/25/WMS进化论/" data-id="ciupcji2s000131p56dk5nkcd" class="article-share-link"><i class="fa fa-share"></i>分享到</a>
<script>
    (function ($) {
        // Prevent duplicate binding
        if (typeof(__SHARE_BUTTON_BINDED__) === 'undefined' || !__SHARE_BUTTON_BINDED__) {
            __SHARE_BUTTON_BINDED__ = true;
        } else {
            return;
        }
        $('body').on('click', function() {
            $('.article-share-box.on').removeClass('on');
        }).on('click', '.article-share-link', function(e) {
            e.stopPropagation();

            var $this = $(this),
                url = $this.attr('data-url'),
                encodedUrl = encodeURIComponent(url),
                id = 'article-share-box-' + $this.attr('data-id'),
                offset = $this.offset(),
                box;

            if ($('#' + id).length) {
                box = $('#' + id);

                if (box.hasClass('on')){
                    box.removeClass('on');
                    return;
                }
            } else {
                var html = [
                    '<div id="' + id + '" class="article-share-box">',
                        '<input class="article-share-input" value="' + url + '">',
                        '<div class="article-share-links">',
                            '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="fa fa-twitter article-share-twitter" target="_blank" title="Twitter"></a>',
                            '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="fa fa-facebook article-share-facebook" target="_blank" title="Facebook"></a>',
                            '<a href="http://pinterest.com/pin/create/button/?url=' + encodedUrl + '" class="fa fa-pinterest article-share-pinterest" target="_blank" title="Pinterest"></a>',
                            '<a href="https://plus.google.com/share?url=' + encodedUrl + '" class="fa fa-google article-share-google" target="_blank" title="Google+"></a>',
                        '</div>',
                    '</div>'
                ].join('');

              box = $(html);

              $('body').append(box);
            }

            $('.article-share-box.on').hide();

            box.css({
                top: offset.top + 25,
                left: offset.left
            }).addClass('on');

        }).on('click', '.article-share-box', function (e) {
            e.stopPropagation();
        }).on('click', '.article-share-box-input', function () {
            $(this).select();
        }).on('click', '.article-share-box-link', function (e) {
            e.preventDefault();
            e.stopPropagation();

            window.open(this.href, 'article-share-box-window-' + Date.now(), 'width=500,height=450');
        });
    })(jQuery);
</script>

            
    
        <a href="http://vwms.cn/2016/10/25/WMS进化论/#comments" class="article-comment-link disqus-comment-count" data-disqus-url="http://vwms.cn/2016/10/25/WMS进化论/">评论</a>
    

        </footer>
    </div>
    
</article>



    <article id="post-WMS2.0的启程" class="article article-type-post" itemscope itemprop="blogPost">
    <div class="article-inner">
        
        
            <header class="article-header">
                
    
        <h1 itemprop="name">
            <a class="article-title" href="/2016/10/25/WMS2.0的启程/">WMS 2.0 的启程</a>
        </h1>
    

                
                    <div class="article-meta">
                        
    <div class="article-date">
        <i class="fa fa-calendar"></i>
        <a href="/2016/10/25/WMS2.0的启程/">
            <time datetime="2016-10-25T08:03:06.000Z" itemprop="datePublished">2016-10-25</time>
        </a>
    </div>


                        
                        
                    </div>
                
            </header>
        
        
        <div class="article-entry" itemprop="articleBody">
        
            
            <p><img src="http://oflf20p0h.bkt.clouddn.com/chuxin.jpg" alt=""><br>&#x6700;&#x8FD1;&#x4E00;&#x4E9B;&#x670B;&#x53CB;&#x77E5;&#x9053;&#x4E86;&#x6211;&#x5728;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6709;&#x4E9B;&#x8868;&#x793A;&#x4E86;&#x9F13;&#x52B1;&#xFF0C;&#x6709;&#x4E9B;&#x8868;&#x8FBE;&#x4E86;&#x8BE7;&#x5F02;&#x3002;&#x51FA;&#x73B0;&#x8FD9;&#x4E24;&#x79CD;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x53CD;&#x5E94;&#x662F;&#x6211;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x7684;&#xFF0C;&#x4F46;&#x4E5F;&#x5728;&#x60C5;&#x7406;&#x4E4B;&#x4E2D;&#x3002;&#x540C;&#x884C;&#x4E86;&#x89E3;&#x540E;&#xFF0C;&#x66F4;&#x591A;&#x662F;&#x8868;&#x793A;&#x80AF;&#x5B9A;&#xFF0C;&#x89C9;&#x5F97;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#xFF01;&#x800C;&#x5176;&#x4ED6;&#x7684;&#x670B;&#x53CB;&#x5C24;&#x5176;&#x662F;&#x505A;&#x7269;&#x6D41;&#x8BBE;&#x5907;&#x7684;&#x670B;&#x53CB;&#x5219;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x5E02;&#x573A;&#x5DF2;&#x7ECF;&#x5982;&#x6B64;&#x6210;&#x719F;&#xFF0C;&#x4F01;&#x4E1A;&#x8F6F;&#x4EF6;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x56FD;&#x5185;&#x7684;&#x51E0;&#x5BB6;&#x5927;&#x5382;&#x7ECF;&#x8FC7;&#x5341;&#x51E0;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x5784;&#x65AD;&#x4E2D;&#x4F4E;&#x7AEF;&#x5E02;&#x573A;&#x4E86;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x9AD8;&#x7AEF;&#x5E02;&#x573A;&#x4E5F;&#x8DDF;&#x5916;&#x8D44;&#x6253;&#x5F97;&#x4F60;&#x6765;&#x6211;&#x5F80;&#xFF0C;&#x4F60;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x505A;&#xFF0C;&#x51F6;&#x591A;&#x5409;&#x5C11;&#x554A;&#x3002;</p>
<p>&#x6709;&#x4EBA;&#x8BF4;&#x521B;&#x4E1A;&#x662F;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x68A6;&#x60F3;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x521B;&#x4E1A;&#x8981;&#x6709;&#x60C5;&#x6000;&#xFF0C;&#x4E5F;&#x6709;&#x4EBA;&#x8BF4;&#x521B;&#x4E1A;&#x8981;&#x770B;&#x4F60;&#x7684;&#x521D;&#x5FC3;&#xFF0C;&#x90A3;&#x4ECA;&#x5929;&#x5C31;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x628A;&#x6211;&#x7684;&#x521D;&#x5FC3;&#x5199;&#x4E0B;&#xFF0C;&#x4E5F;&#x8BA9;&#x6211;&#x53EF;&#x4EE5;&#x5728;&#x6B64;&#x540E;&#x7684;&#x65E5;&#x65E5;&#x591C;&#x591C;&#xFF0C;&#x521D;&#x5FC3;&#x4E0D;&#x5FD8;&#x3002;</p>
<p>&#x6211;&#x6BD5;&#x4E1A;&#x540E;&#x7684;&#x7B2C;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x7684;&#x8001;&#x5927;&#x8BB2;&#x8FC7;&#x4E00;&#x53E5;&#x8BA9;&#x6211;&#x94ED;&#x8BB0;&#x4E00;&#x751F;&#x7684;&#x8BDD;&#xFF0C;&#x201C;&#x518D;&#x6210;&#x719F;&#x7684;&#x5E02;&#x573A;&#x4E5F;&#x4E00;&#x5B9A;&#x6709;&#x673A;&#x4F1A;&#xFF0C;&#x518D;&#x56F0;&#x96BE;&#x7684;&#x73AF;&#x5883;&#x4E5F;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x505A;&#xFF0C;&#x5173;&#x952E;&#x770B;&#x4F60;&#x600E;&#x4E48;&#x505A;&#xFF01;&#x201D;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;WMS&#x5E02;&#x573A;&#x8FDC;&#x6CA1;&#x6709;&#x6210;&#x719F;&#x5230;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x673A;&#x4F1A;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x9971;&#x548C;&#x5230;&#x5BB9;&#x4E0D;&#x5F97;&#x65B0;&#x73A9;&#x5BB6;&#x7684;&#x5730;&#x6B65;&#xFF0C;&#x76F8;&#x53CD;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E0A;&#x4E16;&#x7EAA;&#x7684;&#x542F;&#x8499;&#x548C;&#x672C;&#x4E16;&#x7EAA;&#x524D;&#x5341;&#x591A;&#x5E74;&#x7684;&#x5B55;&#x80B2;&#xFF0C;WMS&#x5E02;&#x573A;&#x6B63;&#x8FCE;&#x6765;&#x4E86;&#x53D1;&#x5C55;&#x7684;&#x9EC4;&#x91D1;&#x65F6;&#x95F4;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8BF4;&#xFF1F;&#x770B;&#x770B;&#x8FC7;&#x53BB;&#x4E09;&#x5E74;&#x8FD9;&#x51E0;&#x5BB6;&#x4E3B;&#x6D41;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x7B7E;&#x7EA6;&#x65B0;&#x95FB;&#x548C;&#x9500;&#x552E;&#x989D;&#x589E;&#x901F;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#x3002;&#x54EA;&#x4E00;&#x5BB6;&#x4E0D;&#x662F;40%&#x4EE5;&#x4E0A;&#x7684;&#x589E;&#x901F;&#xFF0C;&#x54EA;&#x4E00;&#x5BB6;&#x7684;&#x9500;&#x552E;&#x4E0D;&#x662F;&#x5FD9;&#x5230;&#x4E0D;&#x53EF;&#x5F00;&#x4EA4;&#xFF0C;&#x7B7E;&#x4E86;&#x5408;&#x540C;&#x987E;&#x95EE;&#x90FD;&#x5B89;&#x6392;&#x4E0D;&#x8FC7;&#x6765;&#x3002;</p>
<p>&#x5728;&#x53BB;&#x5E74;&#x5F00;&#x59CB;&#x915D;&#x917F;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8DDF;&#x5F88;&#x591A;&#x670B;&#x53CB;&#x804A;&#x5929;&#xFF0C;&#x5927;&#x5BB6;&#x5BF9;&#x73B0;&#x5728;&#x7684;WMS&#x5E02;&#x573A;&#x6709;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x5224;&#x65AD;&#xFF1A;&#x4E13;&#x4E1A;&#x8F6F;&#x4EF6;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#xFF0C;&#x80FD;&#x6EE1;&#x8DB3;&#x5404;&#x79CD;&#x9700;&#x6C42;&#xFF0C;&#x4F46;&#x8D39;&#x7528;&#x9AD8;&#xFF0C;&#x5B9E;&#x65BD;&#x5468;&#x671F;&#x957F;&#xFF0C;&#x754C;&#x9762;&#x4E11;&#xFF0C;&#x4EA4;&#x4E92;&#x5DEE;&#xFF0C;&#x5B66;&#x4E60;&#x6210;&#x672C;&#x9AD8;&#xFF0C;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x4E2D;&#x5C0F;&#x4F01;&#x4E1A;&#xFF0C;&#x90A3;&#x662F;&#x5426;&#x6709;&#x9488;&#x5BF9;&#x4E2D;&#x5C0F;&#x4F01;&#x4E1A;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5462;&#xFF1F;&#x8FD1;&#x4E9B;&#x5E74;&#x5927;&#x70ED;&#x7684;SaaS&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>SaaS&#x901A;&#x8FC7;&#x4E91;&#x7AEF;&#x90E8;&#x7F72;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x4F01;&#x4E1A;&#x81EA;&#x5EFA;IT&#x56E2;&#x961F;&#x81EA;&#x8D2D;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6210;&#x672C;&#xFF1B;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x8BA1;&#x8D39;&#x6A21;&#x578B;&#xFF0C;&#x8BA9;&#x4F01;&#x4E1A;&#x53EF;&#x4EE5;&#x6309;&#x9700;&#x8D2D;&#x4E70;&#xFF1B;&#x901A;&#x8FC7;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#xFF0C;&#x8BA9;&#x65E0;&#x9650;&#x7684;&#x4E91;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x4EE5;&#x6700;&#x7ECF;&#x6D4E;&#x7684;&#x65B9;&#x5F0F;&#x6EE1;&#x8DB3;&#x7269;&#x6D41;&#x4E2D;&#x5FC3;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x54CD;&#x5E94;&#x9700;&#x6C42;&#x3002;&#x5728;SaaS&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;2C&#x7684;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x6D41;&#x7A0B;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x66F4;&#x52A0;&#x79D1;&#x5B66;&#x7684;&#x8BBE;&#x8BA1;&#x4E00;&#x5957;&#x529F;&#x80FD;&#x5168;&#x9762;&#x4F46;&#x201C;&#x770B;&#x8D77;&#x6765;&#x7B80;&#x5355;&#x201D;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#xFF0C;&#x89E3;&#x51B3;&#x754C;&#x9762;&#x548C;&#x4EA4;&#x4E92;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x5B66;&#x4E60;&#x6210;&#x672C;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x53EF;&#x4EE5;&#x7F29;&#x77ED;&#x76F8;&#x5E94;&#x7684;&#x5B9E;&#x65BD;&#x5468;&#x671F;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x4E0A;&#x8FD9;&#x4E9B;&#x8BF4;&#x8D77;&#x6765;&#x5BB9;&#x6613;&#x4F46;&#x8981;&#x5B8C;&#x5168;&#x5B9E;&#x73B0;&#x662F;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8270;&#x82E6;&#x7684;&#x8FC7;&#x7A0B;&#x7684;&#xFF0C;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x7ECF;&#x8FC7;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x5728;&#x73B0;&#x6709;&#x7684;&#x51E0;&#x4E2A;&#x9879;&#x76EE;&#x4E0A;&#x6B63;&#x5728;&#x9010;&#x6B65;&#x5370;&#x8BC1;&#x6211;&#x4EEC;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x5B9E;&#x73B0;&#x68A6;&#x60F3;&#x7684;&#x8DEF;&#x4E0A;&#xFF01;</p>
<p> &#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4E0D;&#x4F46;&#x597D;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x597D;&#x770B;&#x3002;&#x8BA9;&#x4ED3;&#x5E93;&#x7684;&#x4EBA;&#x53EF;&#x4EE5;&#x4E0D;&#x518D;&#x52A0;&#x73ED;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E0D;&#x518D;&#x67AF;&#x71E5;&#xFF0C;&#x80FD;&#x591F;&#x6709;&#x6210;&#x5C31;&#x611F;&#x7684;&#x5B8C;&#x6210;&#x6BCF;&#x4E00;&#x7B14;&#x4E1A;&#x52A1;&#xFF0C;&#x4F53;&#x4F1A;&#x5230;&#x5DE5;&#x4F5C;&#x7684;&#x4E50;&#x8DA3;&#x3002;&#x6240;&#x4EE5;&#x5FAE;&#x4ED3;&#x4EBA;&#x7684;&#x4F7F;&#x547D;&#x662F;&#x8BA9;&#x7269;&#x6D41;&#x4EBA;&#x66F4;&#x5FEB;&#x4E50;&#xFF01;</p>

        
        </div>
        <footer class="article-footer">
            <div class="share-container">



</div>

    <a data-url="http://vwms.cn/2016/10/25/WMS2.0的启程/" data-id="ciupcji3p000231p5z1mmr4ez" class="article-share-link"><i class="fa fa-share"></i>分享到</a>
<script>
    (function ($) {
        // Prevent duplicate binding
        if (typeof(__SHARE_BUTTON_BINDED__) === 'undefined' || !__SHARE_BUTTON_BINDED__) {
            __SHARE_BUTTON_BINDED__ = true;
        } else {
            return;
        }
        $('body').on('click', function() {
            $('.article-share-box.on').removeClass('on');
        }).on('click', '.article-share-link', function(e) {
            e.stopPropagation();

            var $this = $(this),
                url = $this.attr('data-url'),
                encodedUrl = encodeURIComponent(url),
                id = 'article-share-box-' + $this.attr('data-id'),
                offset = $this.offset(),
                box;

            if ($('#' + id).length) {
                box = $('#' + id);

                if (box.hasClass('on')){
                    box.removeClass('on');
                    return;
                }
            } else {
                var html = [
                    '<div id="' + id + '" class="article-share-box">',
                        '<input class="article-share-input" value="' + url + '">',
                        '<div class="article-share-links">',
                            '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="fa fa-twitter article-share-twitter" target="_blank" title="Twitter"></a>',
                            '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="fa fa-facebook article-share-facebook" target="_blank" title="Facebook"></a>',
                            '<a href="http://pinterest.com/pin/create/button/?url=' + encodedUrl + '" class="fa fa-pinterest article-share-pinterest" target="_blank" title="Pinterest"></a>',
                            '<a href="https://plus.google.com/share?url=' + encodedUrl + '" class="fa fa-google article-share-google" target="_blank" title="Google+"></a>',
                        '</div>',
                    '</div>'
                ].join('');

              box = $(html);

              $('body').append(box);
            }

            $('.article-share-box.on').hide();

            box.css({
                top: offset.top + 25,
                left: offset.left
            }).addClass('on');

        }).on('click', '.article-share-box', function (e) {
            e.stopPropagation();
        }).on('click', '.article-share-box-input', function () {
            $(this).select();
        }).on('click', '.article-share-box-link', function (e) {
            e.preventDefault();
            e.stopPropagation();

            window.open(this.href, 'article-share-box-window-' + Date.now(), 'width=500,height=450');
        });
    })(jQuery);
</script>

            
    
        <a href="http://vwms.cn/2016/10/25/WMS2.0的启程/#comments" class="article-comment-link disqus-comment-count" data-disqus-url="http://vwms.cn/2016/10/25/WMS2.0的启程/">评论</a>
    

        </footer>
    </div>
    
</article>


</section>
            
                <aside id="sidebar">
   
        
    <div class="widget-wrap">
        <h3 class="widget-title">最新文章</h3>
        <div class="widget">
            <ul id="recent-post" class="">
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2016/10/25/WMS进化论之二 – 简单 不简单/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2016/10/25/WMS进化论之二 – 简单 不简单/" class="title">WMS进化论之二 – 简单 不简单</a></p>
                            <p class="item-date"><time datetime="2016-10-25T09:10:43.000Z" itemprop="datePublished">2016-10-25</time></p>
                        </div>
                    </li>
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2016/10/25/WMS进化论/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2016/10/25/WMS进化论/" class="title">WMS进化论</a></p>
                            <p class="item-date"><time datetime="2016-10-25T08:45:40.000Z" itemprop="datePublished">2016-10-25</time></p>
                        </div>
                    </li>
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2016/10/25/WMS2.0的启程/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2016/10/25/WMS2.0的启程/" class="title">WMS 2.0 的启程</a></p>
                            <p class="item-date"><time datetime="2016-10-25T08:03:06.000Z" itemprop="datePublished">2016-10-25</time></p>
                        </div>
                    </li>
                
            </ul>
        </div>
    </div>

    
        
    
        
    <div class="widget-wrap">
        <h3 class="widget-title">归档</h3>
        <div class="widget">
            <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a><span class="archive-list-count">3</span></li></ul>
        </div>
    </div>

    
        
    
        
    
        
    <div class="widget-wrap widget-list">
        <h3 class="widget-title">链接</h3>
        <div class="widget">
            <ul>
                
                    <li>
                        <a href="http://hexo.io">Hexo</a>
                    </li>
                
            </ul>
        </div>
    </div>


    
    <div id="toTop" class="fa fa-angle-up"></div>
</aside>
            
        </div>
        <footer id="footer">
    <div class="outer">
        <div id="footer-info" class="inner">
            &copy; 2016 vwms<br>
            Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>. Theme by <a href="http://github.com/ppoffice">PPOffice</a>
        </div>
    </div>
</footer>
        
    
    <script>
    var disqus_config = function () {
        
        this.page.identifier = 'undefined';
    };
    (function() { 
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'hexo-theme-icarus' + '.disqus.com/count.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>



    
        <script src="/vendor/lightgallery/js/lightgallery.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-thumbnail.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-pager.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-autoplay.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-fullscreen.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-zoom.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-hash.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-share.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-video.min.js"></script>
    
    
        <script src="/vendor/justified-gallery/jquery.justifiedGallery.min.js"></script>
    



<!-- Custom Scripts -->
<script src="/js/main.js"></script>

    </div>
</body>
</html>