<!DOCTYPE html>
<html lang=zh>
<head>
    <meta charset="utf-8">
    
    <title>WMS进化论 | 微仓博客</title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1" />
    <meta name="description" content="&amp;#x4E0A;&amp;#x6B21;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#x91CC;&amp;#x63D0;&amp;#x5230;&amp;#x4E86;WMS 2.0&amp;#x7684;&amp;#x6982;&amp;#x5FF5;&amp;#xFF0C;&amp;#x4E4B;&amp;#x540E;&amp;#x5F88;&amp;#x591A;&amp;#x670B;&amp;#x53CB;&amp;#x95EE;&amp;#x662F;&amp;#x4E0D;&amp;#x662F;&amp;#x4F60;&amp;">
<meta property="og:type" content="article">
<meta property="og:title" content="WMS进化论">
<meta property="og:url" content="http://vwms.cn/2016/10/27/WMS进化论/index.html">
<meta property="og:site_name" content="微仓博客">
<meta property="og:description" content="&amp;#x4E0A;&amp;#x6B21;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#x91CC;&amp;#x63D0;&amp;#x5230;&amp;#x4E86;WMS 2.0&amp;#x7684;&amp;#x6982;&amp;#x5FF5;&amp;#xFF0C;&amp;#x4E4B;&amp;#x540E;&amp;#x5F88;&amp;#x591A;&amp;#x670B;&amp;#x53CB;&amp;#x95EE;&amp;#x662F;&amp;#x4E0D;&amp;#x662F;&amp;#x4F60;&amp;">
<meta property="og:image" content="http://oflf20p0h.bkt.clouddn.com/640.jpg">
<meta property="og:image" content="http://oflf20p0h.bkt.clouddn.com/6401.jpg">
<meta property="og:image" content="http://oflf20p0h.bkt.clouddn.com/6402.jpg">
<meta property="og:updated_time" content="2016-10-27T10:08:15.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="WMS进化论">
<meta name="twitter:description" content="&amp;#x4E0A;&amp;#x6B21;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#x91CC;&amp;#x63D0;&amp;#x5230;&amp;#x4E86;WMS 2.0&amp;#x7684;&amp;#x6982;&amp;#x5FF5;&amp;#xFF0C;&amp;#x4E4B;&amp;#x540E;&amp;#x5F88;&amp;#x591A;&amp;#x670B;&amp;#x53CB;&amp;#x95EE;&amp;#x662F;&amp;#x4E0D;&amp;#x662F;&amp;#x4F60;&amp;">
<meta name="twitter:image" content="http://oflf20p0h.bkt.clouddn.com/640.jpg">
    

    
        <link rel="alternate" href="/" title="微仓博客" type="application/atom+xml" />
    

    

    <link rel="stylesheet" href="/vendor/font-awesome/css/font-awesome.min.css">
    <link rel="stylesheet" href="/vendor/open-sans/styles.css">
    <link rel="stylesheet" href="/vendor/source-code-pro/styles.css">

    <link rel="stylesheet" href="/css/style.css">

    <script src="/vendor/jquery/2.1.3/jquery.min.js"></script>
    
    
        <link rel="stylesheet" href="/vendor/lightgallery/css/lightgallery.min.css">
    
    
        <link rel="stylesheet" href="/vendor/justified-gallery/justifiedGallery.min.css">
    
    
    
    


</head>

<body>
    <div id="container">
        <header id="header">
    <div id="header-main" class="header-inner">
        <div class="outer">
            <a href="/" id="logo">
                <i class="logo"></i>
                <span class="site-title">微仓博客</span>
            </a>
            <nav id="main-nav">
                
                    <a class="main-nav-link" href="/.">首页</a>
                
                    <a class="main-nav-link" href="/archives">归档</a>
                
                    <a class="main-nav-link" href="/about">关于</a>
                
            </nav>
            
                
                <nav id="sub-nav">
                    <div class="profile" id="profile-nav">
                        <a id="profile-anchor" href="javascript:;">
                            <img class="avatar" src="/css/images/avatar.png" />
                            <i class="fa fa-caret-down"></i>
                        </a>
                    </div>
                </nav>
            
            <div id="search-form-wrap">

    <form class="search-form">
        <input type="text" class="ins-search-input search-form-input" placeholder="搜索" />
        <button type="submit" class="search-form-submit"></button>
    </form>
    <div class="ins-search">
    <div class="ins-search-mask"></div>
    <div class="ins-search-container">
        <div class="ins-input-wrapper">
            <input type="text" class="ins-search-input" placeholder="想要查找什么..." />
            <span class="ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
(function (window) {
    var INSIGHT_CONFIG = {
        TRANSLATION: {
            POSTS: '文章',
            PAGES: '页面',
            CATEGORIES: '分类',
            TAGS: '标签',
            UNTITLED: '(未命名)',
        },
        ROOT_URL: '/',
        CONTENT_URL: '/content.json',
    };
    window.INSIGHT_CONFIG = INSIGHT_CONFIG;
})(window);
</script>
<script src="/js/insight.js"></script>

</div>
        </div>
    </div>
    <div id="main-nav-mobile" class="header-sub header-inner">
        <table class="menu outer">
            <tr>
                
                    <td><a class="main-nav-link" href="/.">首页</a></td>
                
                    <td><a class="main-nav-link" href="/archives">归档</a></td>
                
                    <td><a class="main-nav-link" href="/about">关于</a></td>
                
                <td>
                    
    <div class="search-form">
        <input type="text" class="ins-search-input search-form-input" placeholder="搜索" />
    </div>

                </td>
            </tr>
        </table>
    </div>
</header>

        <div class="outer">
            
                

<aside id="profile">
    <div class="inner profile-inner">
        <div class="base-info profile-block">
            <img id="avatar" src="/css/images/avatar.png" />
            <h2 id="name">Vwms</h2>
            <h3 id="title">more than a wms</h3>
            <span id="location"><i class="fa fa-map-marker"></i>shanghai, China</span>
            <a id="follow" target="_blank" href="http://www.vwms.cn">关注我</a>
        </div>
       <!-- <div class="article-info profile-block">
            <div class="article-info-block">
                3
                <span>文章</span>
            </div>
            <div class="article-info-block">
                0
                <span>标签</span>
            </div>
        </div>-->
        
       <!-- <div class="profile-block social-links">
            <table>
                <tr>
                    
                    
                    <td>
                        <a href="http://github.com/ppoffice/hexo-theme-icarus" target="_blank" title="github" class=tooltip>
                            <i class="fa fa-github"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="twitter" class=tooltip>
                            <i class="fa fa-twitter"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="facebook" class=tooltip>
                            <i class="fa fa-facebook"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="dribbble" class=tooltip>
                            <i class="fa fa-dribbble"></i>
                        </a>
                    </td>
                    
                    <td>
                        <a href="/" target="_blank" title="rss" class=tooltip>
                            <i class="fa fa-rss"></i>
                        </a>
                    </td>
                    
                </tr>
            </table>
        </div>-->
        
    </div>
</aside>

            
            <section id="main"><article id="post-WMS进化论" class="article article-type-post" itemscope itemprop="blogPost">
    <div class="article-inner">
        
        
            <header class="article-header">
                
    
        <h1 class="article-title" itemprop="name">
            WMS进化论
        </h1>
    

                
                    <div class="article-meta">
                        
    <div class="article-date">
        <i class="fa fa-calendar"></i>
        <a href="/2016/10/27/WMS进化论/">
            <time datetime="2016-10-27T10:08:15.000Z" itemprop="datePublished">2016-10-27</time>
        </a>
    </div>


                        
                        
                    </div>
                
            </header>
        
        
        <div class="article-entry" itemprop="articleBody">
        
            
            <p><img src="http://oflf20p0h.bkt.clouddn.com/640.jpg" alt=""><br>&#x4E0A;&#x6B21;&#x7684;&#x6587;&#x7AE0;&#x91CC;&#x63D0;&#x5230;&#x4E86;WMS 2.0&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E4B;&#x540E;&#x5F88;&#x591A;&#x670B;&#x53CB;&#x95EE;&#x662F;&#x4E0D;&#x662F;&#x4F60;&#x4EEC;&#x53D1;&#x5E03;&#x4E86;2.0&#x7248;&#x672C;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x770B;&#x6765;&#xFF0C; 2.0&#x662F;&#x533A;&#x522B;&#x4E8E;&#x73B0;&#x6709;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x4EE5;SaaS&#x6280;&#x672F;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x65B0;&#x4E00;&#x4EE3;WMS&#x4EA7;&#x54C1;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x4EA7;&#x54C1;&#x9700;&#x8981;&#x5177;&#x5907;&#x5982;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;<br><a id="more"></a><br><strong>&#x6539;&#x53D8;&#x4E86;&#x8D39;&#x6536;&#x6A21;&#x578B;&#xFF0C;&#x6536;&#x5165;&#x6A21;&#x5F0F;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;</strong><br><img src="http://oflf20p0h.bkt.clouddn.com/6401.jpg" alt=""><br>&#x6309;&#x4ED3;&#x5E93;&#x3001;&#x7528;&#x6237;&#x6570;&#x4E3A;&#x57FA;&#x51C6;&#x7684;&#x8F6F;&#x4EF6;&#x6388;&#x6743;&#x8D39;&#x7528;&#xFF1B;&#x4EE5;&#x4EBA;&#x5929;&#x8BA1;&#x4EF7;&#x7684;&#x5B9E;&#x65BD;&#x548C;&#x4E8C;&#x6B21;&#x5F00;&#x53D1;&#x8D39;&#x7528;&#x4EE5;&#x53CA;&#x6309;&#x524D;&#x4E24;&#x8005;&#x4E00;&#x5B9A;&#x6BD4;&#x4F8B;(15%~25%)&#x8BA1;&#x6536;&#x7684;&#x5E74;&#x5EA6;&#x8F6F;&#x4EF6;&#x7EF4;&#x62A4;&#x8D39;&#x662F;&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x8425;&#x6536;&#x7684;&#x4E09;&#x79CD;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x3002;</p>
<p>&#x800C;&#x4F5C;&#x4E3A;SaaS&#x8F6F;&#x4EF6;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x663E;&#x8457;&#x7279;&#x70B9;&#x5373;&#x5C06;&#x8F6F;&#x4EF6;&#x6388;&#x6743;&#x8D39;&#x7528;&#x7531;&#x4E70;&#x65AD;&#x6539;&#x4E3A;&#x79DF;&#x7528;&#xFF0C;&#x5C06;&#x4F01;&#x4E1A;&#x4E00;&#x6B21;&#x6027;&#x7684;IT&#x9884;&#x7B97;&#x53EF;&#x4EE5;&#x957F;&#x671F;&#x7684;&#x5206;&#x591A;&#x6B21;&#x652F;&#x4ED8;&#xFF0C;&#x540C;&#x65F6;&#x53D6;&#x6D88;&#x4E86;&#x5B9E;&#x65BD;&#x548C;&#x7EF4;&#x62A4;&#x8D39;&#x7528;&#xFF0C;&#x5927;&#x5E45;&#x964D;&#x4F4E;&#x4E86;&#x8F6F;&#x4EF6;&#x91C7;&#x8D2D;&#x6210;&#x672C;&#x3002;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x539F;&#x6765;&#x4F60;&#x4E70;&#x4E00;&#x5957;WMS&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x642D;&#x5EFA;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x52A8;&#x8F84;&#x51E0;&#x4E07;&#x51E0;&#x5341;&#x4E07;&#x7684;&#x670D;&#x52A1;&#x5668;&#x786C;&#x4EF6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x6210;&#x672C;&#xFF0C;&#x8FD9;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x8FD8;&#x8981;&#x96C7;IT&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x548C;&#x7EF4;&#x62A4;&#xFF0C;&#x5907;&#x4EFD;&#x3001;&#x6740;&#x6BD2;&#x3001;&#x8FD0;&#x7EF4;&#x76D1;&#x63A7;&#x65E0;&#x4E00;&#x4E0D;&#x9700;&#x8981;&#x6210;&#x672C;&#x6295;&#x5165;&#x3002;&#x5728;SaaS&#x65F6;&#x4EE3;&#xFF0C;&#x8FD9;&#x4E9B;&#x6210;&#x672C;&#x662F;&#x5927;&#x5E45;&#x524A;&#x51CF;&#x7684;&#xFF0C;&#x4F01;&#x4E1A;&#x6CE8;&#x518C;&#x5F00;&#x901A;&#x540E;&#x76F4;&#x63A5;&#x6253;&#x5F00;&#x7F51;&#x9875;&#x5373;&#x53EF;&#x4F7F;&#x7528;&#x8F6F;&#x4EF6;&#xFF0C;&#x65E0;&#x987B;&#x64CD;&#x5FC3;&#x670D;&#x52A1;&#x5668;&#x91C7;&#x8D2D;&#x548C;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5FAE;&#x8F6F;&#x3001;&#x7532;&#x9AA8;&#x6587;&#x54EA;&#x5929;&#x627E;&#x4E0A;&#x95E8;&#x6765;&#x6536;&#x53D6;&#x8BB8;&#x53EF;&#x8D39;&#x7528;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x4EA4;&#x7ED9;SaaS&#x670D;&#x52A1;&#x5546;&#x6765;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;&#xFF0C;&#x5206;&#x5DE5;&#x4EA7;&#x751F;&#x6548;&#x80FD;&#xFF0C;&#x4E13;&#x4E1A;&#x4EA7;&#x751F;&#x6548;&#x7387;&#xFF0C;&#x8FD9;&#x4E2A;&#x6210;&#x672C;&#x4E00;&#x5B9A;&#x662F;&#x6BD4;&#x4F01;&#x4E1A;&#x81EA;&#x5DF1;&#x7BA1;&#x7406;&#x4F4E;&#x3002;</p>
<p><strong>&#x5148;&#x5C1D;&#x540E;&#x4E70;&#xFF0C;&#x6309;&#x9700;&#x91C7;&#x8D2D;&#xFF0C;&#x968F;&#x4E70;&#x968F;&#x7528;</strong><br><img src="http://oflf20p0h.bkt.clouddn.com/6402.jpg" alt=""><br>&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x7684;&#x9500;&#x552E;&#x65B9;&#x5F0F;&#x662F;&#x7531;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x9500;&#x552E;&#x548C;&#x987E;&#x95EE;&#x7ECF;&#x8FC7;&#x524D;&#x671F;&#x6C9F;&#x901A;&#x3001;&#x73B0;&#x573A;&#x8C03;&#x7814;&#x3001;&#x6848;&#x4F8B;&#x53C2;&#x89C2;&#x3001;&#x65B9;&#x6848;&#x8BB2;&#x89E3;&#x7B49;&#x73AF;&#x8282;&#x8BA9;&#x5BA2;&#x6237;&#x4E86;&#x89E3;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x80FD;&#x529B;&#x548C;&#x4EA7;&#x54C1;&#xFF0C;&#x4F46;&#x5F80;&#x5F80;&#x7531;&#x4E8E;&#x5468;&#x671F;&#x8FC7;&#x957F;&#x4EE5;&#x53CA;&#x5BA2;&#x6237;&#x5BF9;&#x552E;&#x524D;&#x4EBA;&#x5458;&#x7684;&#x4FE1;&#x4EFB;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x8FDE;&#x8F6F;&#x4EF6;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x90FD;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x5C31;&#x7B7E;&#x8BA2;&#x4E86;&#x8D2D;&#x4E70;&#x5408;&#x540C;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x4EA7;&#x54C1;&#x8DDF;&#x4E1A;&#x52A1;&#x7684;&#x5951;&#x5408;&#x5EA6;&#x3001;&#x64CD;&#x4F5C;&#x7684;&#x6D41;&#x7545;&#x6027;&#x548C;&#x4EA4;&#x4E92;&#x7684;&#x53CB;&#x597D;&#x6027;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x7CFB;&#x7EDF;&#x8981;&#x57F9;&#x8BAD;&#x4E0A;&#x7EBF;&#x4E86;&#x751A;&#x81F3;&#x5728;&#x4E0A;&#x7EBF;&#x4E4B;&#x540E;&#xFF0C;&#x5BA2;&#x6237;&#x624D;&#x53D1;&#x73B0;&#x6709;&#x4E9B;&#x64CD;&#x4F5C;&#x4E60;&#x60EF;&#x548C;&#x529F;&#x80FD;&#x7EC6;&#x8282;&#x9700;&#x8981;&#x6539;&#x8FDB;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F9B;&#x5E94;&#x5546;&#x6536;&#x4F60;&#x4E2A;&#x670D;&#x52A1;&#x8BA2;&#x5355;&#xFF0C;&#x52A0;&#x70B9;&#x4EBA;&#x5929;&#x8D39;&#x662F;&#x6B63;&#x5E38;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6536;&#x8D39;&#xFF0C;&#x90A3;&#x662F;&#x826F;&#x5FC3;&#x3002;&#x4E1A;&#x5185;&#x67D0;&#x670D;&#x88C5;&#x7269;&#x6D41;&#x4E2D;&#x5FC3;&#x5C31;&#x66FE;&#x7ECF;&#x5728;&#x4E0A;&#x7EBF;&#x540E;&#x589E;&#x52A0;&#x4E86;400&#x591A;&#x4EBA;&#x5929;&#x7684;&#x670D;&#x52A1;&#x8BA2;&#x5355;&#xFF0C;&#x4F60;&#x8BF4;&#x8FD9;&#x662F;&#x8C01;&#x7684;&#x8FC7;&#xFF1F;</p>
<p>SaaS WMS&#x4ECE;&#x91C7;&#x8D2D;&#x6A21;&#x5F0F;&#x4E0A;&#x89C4;&#x907F;&#x4E86;&#x5982;&#x4E0A;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x5BA2;&#x6237;&#x5728;&#x8D2D;&#x4E70;&#x4E4B;&#x524D;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x7EBF;&#x8BD5;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x4EA7;&#x54C1;&#x7684;&#x529F;&#x80FD;&#x7EC6;&#x8282;&#x548C;&#x64CD;&#x4F5C;&#x6D41;&#x7A0B;&#xFF0C;&#x6EE1;&#x610F;&#x4E86;&#x518D;&#x4E70;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x597D;&#xFF0C;&#x6389;&#x5934;&#x5C31;&#x8D70;&#x561B;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x5F00;&#x901A;&#x4E86;&#x6B63;&#x5F0F;&#x7528;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7528;&#x4E0B;&#x6765;&#x89C9;&#x5F97;&#x4E0D;&#x597D;&#x7528;&#xFF0C;&#x8DF3;&#x51FA;&#x6210;&#x672C;&#x4E5F;&#x662F;&#x6781;&#x4F4E;&#x7684;&#xFF0C;&#x6362;&#x5957;&#x7CFB;&#x7EDF;&#x4E5F;&#x5C31;&#x662F;&#x51E0;&#x5929;&#x7684;&#x529F;&#x592B;&#xFF1B;&#x4F20;&#x7EDF;&#x6A21;&#x5F0F;&#x4F60;&#x8BD5;&#x8BD5;&#xFF0C;&#x82B1;&#x4E86;&#x51E0;&#x5341;&#x4E07;&#x4E0A;&#x767E;&#x4E07;&#x4E70;&#x5957;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E0A;&#x7EBF;&#x4E86;&#x4F60;&#x89C9;&#x5F97;&#x4E0D;&#x597D;&#x7528;&#xFF0C;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x9884;&#x671F;&#x6548;&#x679C;&#xFF0C;&#x4F60;&#x8DDF;&#x8001;&#x677F;&#x8BF4;&#x6211;&#x60F3;&#x6362;&#x4E86;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x662F;&#x4F9B;&#x5E94;&#x5546;&#x4F1A;&#x9000;&#x94B1;&#x7ED9;&#x4F60;&#x8FD8;&#x662F;&#x8001;&#x677F;&#x780D;&#x4E86;&#x4F60;&#xFF1F;&#x8001;&#x5B9E;&#x7684;&#x7EE7;&#x7EED;&#x5FCD;&#x8FB1;&#x8D1F;&#x91CD;&#x8DDF;&#x4F9B;&#x5E94;&#x5546;&#x6597;&#x667A;&#x6597;&#x52C7;&#x5427;&#xFF0C;&#x4E0A;&#x8F66;&#x5BB9;&#x6613;&#x4E0B;&#x8F66;&#x96BE;&#x554A;&#x3002;</p>
<p>SaaS&#x65E0;&#x8BBA;&#x662F;&#x6309;&#x65F6;&#x957F;&#x8FD8;&#x662F;&#x6309;&#x6D41;&#x91CF;&#xFF0C;&#x4EFB;&#x4F55;&#x8BA1;&#x8D39;&#x65B9;&#x5F0F;&#x90FD;&#x662F;&#x6E05;&#x6670;&#x53EF;&#x8861;&#x91CF;&#x7684;&#xFF0C;&#x7528;&#x7684;&#x591A;&#x6210;&#x672C;&#x9AD8;&#xFF0C;&#x7528;&#x7684;&#x5C11;&#x6210;&#x672C;&#x4F4E;&#xFF0C;&#x4E5F;&#x90FD;&#x662F;&#x516C;&#x5F00;&#x548C;&#x900F;&#x660E;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x4F01;&#x4E1A;&#x7684;&#x4EF7;&#x683C;&#x90FD;&#x662F;&#x5728;&#x5B98;&#x7F51;&#x516C;&#x5F00;&#x7684;&#xFF08;&#x76EE;&#x524D;Vwms&#x7684;&#x4EF7;&#x683C;&#x65B9;&#x6848;&#x4F1A;&#x5728;&#x6CE8;&#x518C;&#x540E;&#x90AE;&#x4EF6;&#x7ED9;&#x5BA2;&#x6237;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x4F60;&#x91C7;&#x8D2D;&#x4EBA;&#x5458;&#x7684;&#x8BAE;&#x4EF7;&#x80FD;&#x529B;&#x5403;&#x4E8F;&#x6216;&#x8005;&#x5360;&#x4FBF;&#x5B9C;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x540C;&#x6837;&#x89C4;&#x6A21;&#x7684;&#x4E24;&#x5BB6;&#x4F01;&#x4E1A;&#x4E70;&#x4E00;&#x5957;&#x8F6F;&#x4EF6;&#x82B1;&#x8D39;&#x5DEE;&#x4E00;&#x500D;&#x7684;&#x60C5;&#x51B5;&#x3002;Vwms&#x6309;&#x51FA;&#x5E93;&#x5355;&#x91CF;&#x8BA1;&#x8D39;&#xFF0C;&#x6BCF;&#x53D1;&#x4E00;&#x4E2A;&#x5305;&#x88F9;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x6E05;&#x6670;&#x7684;&#x6838;&#x7B97;&#x5728;&#x8FD9;&#x4E2A;&#x5305;&#x88F9;&#x4E0A;&#x4EA7;&#x751F;&#x7684;&#x8F6F;&#x4EF6;&#x8D39;&#x7528;&#xFF0C;&#x8DDF;&#x4F60;&#x7684;&#x5305;&#x88C5;&#x8017;&#x6750;&#x4E00;&#x6837;&#x4EF7;&#x683C;&#x6E05;&#x6670;&#xFF0C;&#x9884;&#x7B97;&#x53EF;&#x63A7;&#x3002;</p>
<p><strong>&#x6C34;&#x5E73;&#x6269;&#x5C55;&#xFF0C;&#x968F;&#x65F6;&#x6269;&#x5BB9;</strong><br>&#x4F20;&#x7EDF;&#x65F6;&#x4EE3;&#x4F01;&#x4E1A;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x5CF0;&#x503C;&#x7684;&#x4E1A;&#x52A1;&#x538B;&#x529B;&#xFF0C;&#x4F1A;&#x6309;&#x6700;&#x5927;&#x503C;&#x8FDB;&#x884C;&#x8BBE;&#x5907;&#x91C7;&#x8D2D;&#xFF0C;&#x8D85;&#x5BB9;&#x91CF;&#x6765;&#x8D2D;&#x4E70;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x53CC;&#x5341;&#x4E00;&#x7684;&#x7CFB;&#x7EDF;&#x538B;&#x529B;&#xFF0C;&#x591A;&#x82B1;&#x4E86;&#x51E0;&#x500D;&#x7684;&#x6210;&#x672C;&#x914D;&#x7F6E;&#x9AD8;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x800C;&#x5E73;&#x65F6;&#x4EC5;&#x7528;&#x5230;&#x6027;&#x80FD;&#x7684;15%~20%&#x3002;SaaS WMS&#x63D0;&#x4F9B;&#x4E86;&#x7CFB;&#x7EDF;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5E73;&#x65F6;&#x65E5;&#x5747;500&#x5355;&#xFF0C;&#x4F60;&#x7528;4G&#x5185;&#x5B58;&#xFF0C;2M&#x5E26;&#x5BBD;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5F53;&#x5927;&#x4FC3;&#x9AD8;&#x5CF0;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E34;&#x65F6;&#x589E;&#x52A0;&#x5230;20G&#x5185;&#x5B58;&#xFF0C;10M&#x5E26;&#x5BBD;&#x6EE1;&#x8DB3;&#x4F60;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x5904;&#x7406;&#x9700;&#x6C42;&#xFF0C;&#x9AD8;&#x5CF0;&#x8FC7;&#x53BB;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x91CA;&#x653E;&#x8FD9;&#x4E9B;&#x589E;&#x52A0;&#x7684;&#x5185;&#x5B58;&#x548C;&#x5E26;&#x5BBD;&#x8D44;&#x6E90;&#xFF0C;&#x5373;&#x8282;&#x7701;&#x4E86;&#x4E91;&#x7A7A;&#x95F4;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x53C8;&#x7701;&#x4E86;&#x6210;&#x672C;&#x3002;&#x5171;&#x4EAB;&#x7ECF;&#x6D4E;&#x65F6;&#x4EE3;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x5668;&#x8FD8;&#x662F;&#x72EC;&#x4EAB;&#x7684;&#xFF0C;&#x4F60;&#x4E0D;&#x89C9;&#x5F97;&#x6D6A;&#x8D39;&#x5417;&#xFF1F;</p>
<p>&#x5F53;&#x7136;&#xFF0C;SaaS&#x7684;&#x4F18;&#x52BF;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x63A2;&#x7D22;&#x5982;&#x4F55;&#x6253;&#x9020;&#x66F4;&#x4EBA;&#x6027;&#x5316;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x66F4;&#x5FEB;&#x66F4;&#x6781;&#x81F4;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x8BA9;&#x6BCF;&#x4E00;&#x4E2A;&#x7269;&#x6D41;&#x4EBA;&#x6709;&#x66F4;&#x987A;&#x624B;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p>WMS 2.0&#x65F6;&#x4EE3;&#x5DF2;&#x7ECF;&#x5230;&#x6765;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x62E5;&#x62B1;&#x6539;&#x53D8;&#xFF0C;&#x671F;&#x5F85;&#x4E00;&#x4E2A;&#x66F4;&#x7F8E;&#x7684;&#x672A;&#x6765;&#xFF01;</p>

        
        </div>
       <!-- <footer class="article-footer">
            <div class="share-container">



</div>

    <a data-url="http://vwms.cn/2016/10/27/WMS进化论/" data-id="ciutcyy7g00040up5p89djwdd" class="article-share-link"><i class="fa fa-share"></i>分享到</a>
<script>
    (function ($) {
        // Prevent duplicate binding
        if (typeof(__SHARE_BUTTON_BINDED__) === 'undefined' || !__SHARE_BUTTON_BINDED__) {
            __SHARE_BUTTON_BINDED__ = true;
        } else {
            return;
        }
        $('body').on('click', function() {
            $('.article-share-box.on').removeClass('on');
        }).on('click', '.article-share-link', function(e) {
            e.stopPropagation();

            var $this = $(this),
                url = $this.attr('data-url'),
                encodedUrl = encodeURIComponent(url),
                id = 'article-share-box-' + $this.attr('data-id'),
                offset = $this.offset(),
                box;

            if ($('#' + id).length) {
                box = $('#' + id);

                if (box.hasClass('on')){
                    box.removeClass('on');
                    return;
                }
            } else {
                var html = [
                    '<div id="' + id + '" class="article-share-box">',
                        '<input class="article-share-input" value="' + url + '">',
                        '<div class="article-share-links">',
                            '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="fa fa-twitter article-share-twitter" target="_blank" title="Twitter"></a>',
                            '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="fa fa-facebook article-share-facebook" target="_blank" title="Facebook"></a>',
                            '<a href="http://pinterest.com/pin/create/button/?url=' + encodedUrl + '" class="fa fa-pinterest article-share-pinterest" target="_blank" title="Pinterest"></a>',
                            '<a href="https://plus.google.com/share?url=' + encodedUrl + '" class="fa fa-google article-share-google" target="_blank" title="Google+"></a>',
                        '</div>',
                    '</div>'
                ].join('');

              box = $(html);

              $('body').append(box);
            }

            $('.article-share-box.on').hide();

            box.css({
                top: offset.top + 25,
                left: offset.left
            }).addClass('on');

        }).on('click', '.article-share-box', function (e) {
            e.stopPropagation();
        }).on('click', '.article-share-box-input', function () {
            $(this).select();
        }).on('click', '.article-share-box-link', function (e) {
            e.preventDefault();
            e.stopPropagation();

            window.open(this.href, 'article-share-box-window-' + Date.now(), 'width=500,height=450');
        });
    })(jQuery);
</script>

            
    
        <a href="http://vwms.cn/2016/10/27/WMS进化论/#comments" class="article-comment-link ds-thread-count" data-thread-key="http://vwms.cn/2016/10/27/WMS进化论/">评论</a>
    

        </footer>-->
    </div>
    
        
<nav id="article-nav">
    
    
        <a href="/2016/10/27/WMS进化论之二 – 简单 不简单/" id="article-nav-older" class="article-nav-link-wrap">
            <strong class="article-nav-caption">下一篇</strong>
            <div class="article-nav-title">WMS进化论之二 – 简单 不简单</div>
        </a>
    
</nav>


    
</article>


    
    <section id="comments">
    
        
    <div class="ds-thread" data-thread-key="2016/10/27/WMS进化论/" data-title="WMS进化论" data-url="http://vwms.cn/2016/10/27/WMS进化论/"></div>
    <style>
        #ds-thread #ds-reset .ds-textarea-wrapper {
            background: none;
        }
        #ds-reset .ds-avatar img {
            box-shadow: none;
        }
        #ds-reset .ds-gradient-bg {
            background: #f7f7f7;
        }
        #ds-thread #ds-reset li.ds-tab a {
            border-radius: 3px;
        }
        #ds-thread #ds-reset .ds-post-button {
            color: white;
            border: none;
            box-shadow: none;
            background: #d32;
            text-shadow: none;
            font-weight: normal;
            font-family: 'Microsoft Yahei';
        }
        #ds-thread #ds-reset .ds-post-button:hover {
            color: white;
            background: #DE594C;
        }
        #ds-thread #ds-reset .ds-post-button:active {
            background: #d32;
        }
        #ds-smilies-tooltip ul.ds-smilies-tabs li a.ds-current {
            color: white;
            background: #d32;
            box-shadow: none;
            text-shadow: none;
            font-weight: normal;
        }
    </style>

    
    </section>

</section>
            
                <aside id="sidebar">
   
        
    <div class="widget-wrap">
        <h3 class="widget-title">最新文章</h3>
        <div class="widget">
            <ul id="recent-post" class="">
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2016/10/27/WMS进化论/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2016/10/27/WMS进化论/" class="title">WMS进化论</a></p>
                            <p class="item-date"><time datetime="2016-10-27T10:08:15.000Z" itemprop="datePublished">2016-10-27</time></p>
                        </div>
                    </li>
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2016/10/27/WMS进化论之二 – 简单 不简单/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2016/10/27/WMS进化论之二 – 简单 不简单/" class="title">WMS进化论之二 – 简单 不简单</a></p>
                            <p class="item-date"><time datetime="2016-10-27T10:08:01.000Z" itemprop="datePublished">2016-10-27</time></p>
                        </div>
                    </li>
                
                    <li>
                        
                        <div class="item-thumbnail">
                            <a href="/2016/10/27/WMS2.0的启程/" class="thumbnail">
    
    
        <span class="thumbnail-image thumbnail-none"></span>
    
</a>

                        </div>
                        
                        <div class="item-inner">
                            <p class="item-category"></p>
                            <p class="item-title"><a href="/2016/10/27/WMS2.0的启程/" class="title">WMS 2.0 的启程</a></p>
                            <p class="item-date"><time datetime="2016-10-27T10:07:18.000Z" itemprop="datePublished">2016-10-27</time></p>
                        </div>
                    </li>
                
            </ul>
        </div>
    </div>

    
        
    
        
    <div class="widget-wrap">
        <h3 class="widget-title">归档</h3>
        <div class="widget">
            <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a><span class="archive-list-count">3</span></li></ul>
        </div>
    </div>

    
        
    
        
    
        
    <div class="widget-wrap widget-list">
        <h3 class="widget-title">链接</h3>
        <div class="widget">
            <ul>
                
                    <li>
                        <a href="http://www.vwms.cn">vwms</a>
                    </li>
                
            </ul>
        </div>
    </div>


    
    <div id="toTop" class="fa fa-angle-up"></div>
</aside>
            
        </div>
        <footer id="footer">
    <div class="outer">
        <div id="footer-info" class="inner">
            &copy; 2016 vwms<br>
			<script type="text/javascript">var cnzz_protocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cspan id='cnzz_stat_icon_1259953885'%3E%3C/span%3E%3Cscript src='" + cnzz_protocol + "s4.cnzz.com/z_stat.php%3Fid%3D1259953885%26show%3Dpic1' type='text/javascript'%3E%3C/script%3E"));</script>

           <!-- Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>. Theme by <a href="http://github.com/ppoffice">PPOffice</a>-->
        </div>
    </div>
</footer>
        
    
  <script type="text/javascript">
var duoshuoQuery = {short_name:"vwms"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>



    
        <script src="/vendor/lightgallery/js/lightgallery.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-thumbnail.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-pager.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-autoplay.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-fullscreen.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-zoom.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-hash.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-share.min.js"></script>
        <script src="/vendor/lightgallery/js/lg-video.min.js"></script>
    
    
        <script src="/vendor/justified-gallery/jquery.justifiedGallery.min.js"></script>
    



<!-- Custom Scripts -->
<script src="/js/main.js"></script>

    </div>
</body>
</html>